[
   {
      "rawhtml": "<p><a href=\"http://scikit-learn.org/dev/modules/neural_networks_supervised.html\">http://scikit-learn.org/dev/modules/neural_networks_supervised.html#multi-layer-perceptron</a></p><p>Il me semble que les réseaux de neurones ne sont pas implémentés pour l'instant dans sklearn. Je viens de voir qu'une implémentation arrivera dans le future (c'est pour l'instant dans la version <strong>0.18.dev0</strong>). Leur implémentation permet de faire de la classification et de la régression.</p>",
      "date": "2015-10-05",
      "images": [],
      "tags": [],
      "title": "Scikit-Lean - Neural Networks"
   },
   {
      "rawhtml": "<p><a href=\"https://blog.harshulja.in/tweetlake-twitter-streaming-data/\">https://blog.harshulja.in/tweetlake-twitter-streaming-data/</a></p><p>Quelqu'un a rédigé un module qui peut être appelé en ligne de commande pour récupérer des données Twitter. N'hésitez pas à demander à Jean-Baptiste qui a également travailler sur la collecte de tweets. </p>",
      "date": "2015-10-05",
      "images": [],
      "tags": [],
      "title": "Twitter Data"
   },
   {
      "rawhtml": "<p><a href=\"https://mxnet.readthedocs.org/en/latest/tutorial/imagenet_full.html&quot; \\t &quot;_blank\">https://mxnet.readthedocs.org/en/latest/tutorial/imagenet_full.html</a></p><p>Ils expliquent comment ils ont entraîné un algo de classification sur un 14 millions d'images. Les classes sont des concepts haut niveau (ex: suspension bridge). Ils fournissent également leur classifier <strong>déjà entraîné</strong>. </p>",
      "date": "2015-10-05",
      "images": [],
      "tags": [],
      "title": "Reconnaissance d'images"
   },
   {
      "rawhtml": "<p>How do you build a classifier when the training set doesn't fit in RAM ? You need a classifier that supports online learning. One problem that can arise is that the feature space changes over the iterations. A possible solution is to hash the inputs. The resulting features are bound to a chosen space. This technic can be used for text classification. </p><ul><li><a href=\"http://scikit-learn.org/stable/auto_examples/applications/plot_out_of_core_classification.html\">example from scikit learn</a></li><li>r<a href=\"http://www.opendatascience.com/blog/riding-on-large-data-with-scikit-learn/\">eal-world example on 36Gb dataset</a></li><li><a href=\"http://blog.someben.com/2013/01/hashing-lang/\">more on the hashing trick</a></li></ul>",
      "date": "2015-11-02",
      "images": [],
      "tags": [],
      "title": "Out of core classification"
   },
   {
      "rawhtml": "<p>From the abstract of the article: Change detection in multivariate time series has applications in many domains, including health care and network monitoring. A common approach to detect changes is to compare the divergence between the distributions of a reference window and a test window. When the number of dimensions is very large, however, the naïve approach has both quality and efficiency issues: to ensure robustness the window size needs to be large, which not only leads to missed alarms but also increases runtime.</p><p><a href=\"http://eda.mmci.uni-saarland.de/prj/light/\">link to article and source code in Java</a></p><p>The article describes a method that may be a bit advanced.. but it is probably full of interesting references useful for event detection in timeseries.</p>",
      "date": "2015-11-02",
      "images": [],
      "tags": [],
      "title": "Change Detection in multivariate timeseries"
   },
   {
      "rawhtml": "<p>A mind map is a way to summarize the hierarchical relationships between concepts (see enclosed image).</p><p><a href=\"https://codesachin.wordpress.com/2015/10/15/generating-rudimentary-mind-maps-from-word2vec-models/\">This blog post</a> shows how to generate a mind map from a text (the underlying graph, not so much the visualization).</p>",
      "date": "2015-11-02",
      "images": [],
      "tags": [],
      "title": "Generating Mind Maps from word2vec model"
   },
   {
      "rawhtml": "<p>Small multiples (<a href=\"http://projects.flowingdata.com/tut/linked_small_multiples_demo/\">demo here</a>) seem obvious, but we rarely (never?) use them. Done properly it is a great way to compare a bunch of categories. Much better than having 15 line plots overlapping one another.</p><p><a href=\"https://flowingdata.com/2014/10/15/linked-small-multiples/\">More info here</a> on the Flowing Data blog that I highly recommend (although some of the content is behind a paywall..)</p>",
      "date": "2015-11-02",
      "images": [],
      "tags": [],
      "title": "Visualization technique: small multiples"
   },
   {
      "rawhtml": "<p>To be efficient, a machine learning pipeline requires human input for several steps: selecting and transforming features, choosing an algorithm and optimizing its hyper-parameters. Even if the first two steps are chosen, the optimization of hyper-parameters is usually done with a Grid Search provided by Scikit-Learn, which explores the full parameter space instead of converging to the best parameters. TPOT is a tool that does all this pipeline optimization for you. It relies on Scikit-Learn.</p><ul><li><a href=\"http://www.randalolson.com/2015/11/15/introducing-tpot-the-data-science-assistant/\">Website for tutorial</a> http://www.randalolson.com/2015/11/15/introducing-tpot-the-data-science-assistant/</li><li><a href=\"https://github.com/rhiever/tpot\">Github </a> https://github.com/rhiever/tpot</li><li>TPOT relies on <a href=\"https://github.com/rsteca/sklearn-deap\">DEAP</a> to perform a Genetic Algorithm optimization of hyper-parameters</li></ul>",
      "date": null,
      "images": [],
      "tags": [],
      "title": "Optimizing Machine Learning Pipelines (Python)"
   },
   {
      "rawhtml": "<p>There are several distributed computation tools that expose an R interface: Parallel package, Distributed R, SparkR. However the syntax is not homogeneous, which makes porting the code difficult. The ddR package provides a single interface for all these tools. </p><ul><li><a href=\"http://www.r-bloggers.com/introducing-distributed-data-structures-in-r/\">Intro in r-bloggers</a> - http://www.r-bloggers.com/introducing-distributed-data-structures-in-r/</li><li><a href=\"https://github.com/vertica/ddR\">Github</a> -  https://github.com/vertica/ddR</li></ul>",
      "date": null,
      "images": [],
      "tags": [],
      "title": "Distributed Data Structures in R"
   },
   {
      "rawhtml": "<p><a href=\"https://opensource.com/life/15/11/getting-started-web-mapping\">This article</a> https://opensource.com/life/15/11/getting-started-web-mapping gives some examples of technologies used to create custom maps.</p><ul><li>Our team SNCF-Végétation (Emmanuel, Pierre, Xavier) used for instance PostgreSQL + <a href=\"http://geoserver.org/\">GeoServer</a> + <a href=\"http://leafletjs.com/\">LeafLet</a> to map accident risks on train tracks.</li></ul>",
      "date": null,
      "images": [],
      "tags": [],
      "title": "Creating Maps on the Web"
   },
   {
      "rawhtml": "<p>Google recently released an <a href=\"https://cloud.google.com/vision/\">API for image</a> analysis. There are several features but probably the most valuable is object detection in images. Limitation: it is a Web API and there probably is a threshold on how many images you can send. It is free at the moment as the project is in the preview phase.</p>",
      "date": null,
      "images": [],
      "tags": [],
      "title": "Cloud Vision API"
   },
   {
      "rawhtml": "<p><a href=\"http://blaze.pydata.org/blog/2015/09/16/reddit-impala/\">This article</a> http://blaze.pydata.org/blog/2015/09/16/reddit-impala/ is an example on Big Data analysis. There dataset is 1Tb uncompressed and is stored in a Hadoop filesystem. Impala is used as a distributed SQL engine to query this data. <a href=\"http://blaze.pydata.org/\">Blaze</a> is a python library that provides a uniform interface for many datasources. </p>",
      "date": null,
      "images": [],
      "tags": [],
      "title": "Big Data with Blaze (Python) and Impala "
   },
   {
      "rawhtml": "<p><a href=\"https://www.ibm.com/developerworks/community/blogs/jfp/entry/Python_Meets_Julia_Micro_Performance?lang=en\">Full Blog Post on IBM developerWorks</a></p><p>If you want to increase the speed at which your Python scripts run, you first need a tool to diagnose which part of the code is taking the longest: a profiler.</p><ul><li>I have used the <a href=\"https://docs.python.org/2/library/profile.html\">cProfile</a> module that is part of the standard library and it does the job</li><li>The article recommends using <a href=\"https://github.com/rkern/line_profiler\">line_profiler</a></li><li>PyCharm also provides a visual profiling tool that can sometimes be usefull</li></ul><p>A possible solution to make the code run faster is to compile it. Several solutions exist:</p><ul><li>I tried <a href=\"http://docs.cython.org/src/reference/compilation.html\">Cython</a> and it was very easy to set up. I recommend using <a href=\"https://github.com/cython/cython/tree/master/pyximport\">pyximport</a> to import compiled files</li><li>The blog post suggests using <a href=\"http://numba.pydata.org/?cm_mc_uid=06605490527514316968829&amp;cm_mc_sid_50200000=1451899518\">Numba</a>. It is supposedly easy to configure when using Anaconda.</li></ul><p>Finally, the articles provides a few tricks that can be used to increase the execution speed: vectorizing, computation caching.</p>",
      "date": "2016-01-04",
      "images": [],
      "tags": [],
      "title": "How to make Python run as fast as Julia?"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/donnemartin/data-science-ipython-notebooks\">View it on github.</a></p><p>This repository contains dozens of notebooks that demonstrate how to use a particular technology. Topics range from Spark to Tensor Flow and Theano. They also have a few notebooks showing how to set up your environment (anaconda, git, amazon web service).</p>",
      "date": "2016-01-04",
      "images": [],
      "tags": [],
      "title": "DataScience Ipython Notebooks Tutorials"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/spotify/luigi\">Luigi</a> is a Python package built by Sptotify that helps you build complex pipelines of batch jobs. It handles dependency resolution, workflow management, visualization, handling failures, command line integration, and much more. It was typically developed to handle Hadoop jobs and related tasks.</p><p>Common Probability Distributions</p><p>Cloudera kindly provided us with a cheat sheet on probability distribution. Check the explanation on <a href=\"http://blog.cloudera.com/blog/2015/12/common-probability-distributions-the-data-scientists-crib-sheet/\">their blog</a>.</p>",
      "date": "2016-01-04",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Luigi"
   },
   {
      "rawhtml": "<ul><li>For R users: ggplot was updated to version 2.0 recently. Check out a short patch note on <a href=\"http://blog.rstudio.org/2015/12/21/ggplot2-2-0-0/\">Rstudio Blog</a></li><li>For Python users: remember that, in matplotlib you can select a style for your plots, ggplot being one of them (<a href=\"http://matplotlib.org/users/style_sheets.html\">see here</a>). However, matlplotlib is updating its default style and things should look better from now on. </li></ul>",
      "date": "2016-01-04",
      "images": [],
      "tags": [],
      "title": "ggplot "
   },
   {
      "rawhtml": "<p>A web API is useful to share the result of your work in a standardized, easily accessible, language agnostic way. Building a web API from an existing code is usually straightforward:</p><ul><li>make sure that the functionality you want to provide is packaged as a function</li><li>create an access route to this function (i.e. a URL)</li><li>run a webserver that receives messages on this URL</li></ul><p>A general introduction on APIs and how to build them <a href=\"https://zapier.com/learn/apis/chapter-1-introduction-to-apis/\">here</a>. If you are an R user the recommended package is <a href=\"http://plumber.trestletech.com/\">Plumber</a> (previously known as rapier). For Python users I suggest either the tiny <a href=\"http://bottlepy.org/docs/dev/index.html\">Bottle</a> or the more full-fledged <a href=\"http://flask.pocoo.org/\">Flask</a>. </p>",
      "date": "2016-01-18",
      "images": [],
      "tags": [],
      "title": "Creating a web API"
   },
   {
      "rawhtml": "<p>This is not really a technical article but rather an overview of data science as both a tool and a field of study. Download PDF <a href=\"http://courses.csail.mit.edu/18.337/2015/docs/50YearsDataScience.pdf\">here</a>. This is a great read both for us and for our clients to get a general idea of where Data Science is now and what is coming next.</p>",
      "date": "2016-01-18",
      "images": [],
      "tags": [],
      "title": "50 Years of Data Science"
   },
   {
      "rawhtml": "<p>This idea of a low rank model is to represent data with fewer, more representative features. Let’s take as an example the classification of text documents. The first step is usually to describe the documents using a Word2Vec approach. In this case a dictionary of several thousands of words is built (even more if you use 2- or 3-grams). So many features can be a problem if you want to train an algorithm. A possible solution is to use topic analysis: vectors of words are summarized in a smaller number of topics. In this example the topics space has a lower rank than the words space.</p><p>H2O has a <a href=\"http://blog.h2o.ai/2015/12/glrm-transfer-learning/\">tutorial</a> on how to use their Generalized Low Rank Models (that is not specific to textual data). A few slides <a href=\"http://fr.slideshare.net/0xdata/generalized-low-rank-models\">here</a> as well.</p>",
      "date": "2016-01-18",
      "images": [],
      "tags": [],
      "title": "Generalized Low Rank Models with H2O"
   },
   {
      "rawhtml": "<ul><li><strong>Sankey Diagrams</strong><br />This kind of visualization is useful when you want to represent a process with inputs and outputs. The widths of the edges are proportional to the value of the flow. Several options are available: <a href=\"http://matplotlib.org/examples/api/sankey_demo_basics.html\">matplotlib</a> demo (rather ugly), blog  <a href=\"http://www.r-bloggers.com/generating-sankey-diagrams-from-rcharts/\">post</a> on R-bloggers,  Javascript with <a href=\"https://developers.google.com/chart/interactive/docs/gallery/sankey\">google</a> charts library.</li></ul><p>Figure : Example of Sankey Diagram using google charts javascript library</p>",
      "date": "2016-01-18",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Visualization Ideas"
   },
   {
      "rawhtml": "<p><a href=\"http://datascienceplus.com/strategies-to-speedup-r-code/\">http://datascienceplus.com/strategies-to-speedup-r-code/</a></p><p>Let’s be honest: R is slow. Here are a few tips to speed up your loops. Some of them seem obvious (vectorize it), some seem more advanced. I will let R users be the judges. </p>",
      "date": "2016-02-01",
      "images": [],
      "tags": [],
      "title": "Strategies to speed up R code"
   },
   {
      "rawhtml": "<p><a href=\"http://blog.dominodatalab.com/applied-spatial-data-science-with-r/\">http://blog.dominodatalab.com/applied-spatial-data-science-with-r/</a></p><p>A complete tutorial on a few packages useful for spatial analysis: <a href=\"https://cran.r-project.org/web/packages/rgeos/index.html\">rgeos</a>, <a href=\"https://cran.r-project.org/web/packages/rgdal/index.html\">rgdal</a>, <a href=\"http://rstudio.github.io/leaflet/\">leaflet</a>, <a href=\"https://cran.r-project.org/web/packages/lubridate/index.html\">lubridate</a>. </p>",
      "date": "2016-02-01",
      "images": [],
      "tags": [],
      "title": "Spatial Data Science with R"
   },
   {
      "rawhtml": "<p><a href=\"http://shahramabyari.com/2016/01/19/detecting-outliers-in-high-dimensional-data-sets/\">http://shahramabyari.com/2016/01/19/detecting-outliers-in-high-dimensional-data-sets/</a></p><p>A Python implementation where the feature space is split in two dimensional spaces and outliers are spotted with a cut-off parameter. The method is called <em>High Contrast Subspaces for Density-Based Outlier Ranking</em> (HiCS)</p>",
      "date": "2016-02-01",
      "images": [],
      "tags": [],
      "title": "Detecting Outliers in High-Dimensional Space"
   },
   {
      "rawhtml": "<p><a href=\"http://etetoolkit.org/\">http://etetoolkit.org/</a></p><p>Python lacks good tree manipulation libraries. I haved used <a href=\"https://networkx.github.io/\">NetworkX</a> in the past; it’s Ok but the visualization part is very basic. Why not give etetoolkit a try?</p>",
      "date": "2016-02-01",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "A Python Framework for the Analysis and Visualization of Trees. "
   },
   {
      "rawhtml": "<p><a href=\"http://www.fullstackpython.com/postgresql.html\">http://www.fullstackpython.com/postgresql.html</a></p><p>This post is an ensemble of resources explaining how to use PostgreSQL with Python. However most of it is target towards web developers using Django..</p>",
      "date": "2016-02-01",
      "images": [],
      "tags": [],
      "title": "Using PostgreSQL with Python"
   },
   {
      "rawhtml": "<p><a href=\"http://arnicas.github.io/interactive-vis-course/index.html\">http://arnicas.github.io/interactive-vis-course/index.html</a></p><p>A complete course in a repository to teach you the basics and the advanced of D3.js, the most prominent javascript dataviz library.</p>",
      "date": "2016-02-01",
      "images": [],
      "tags": [],
      "title": "Interactive Web Viz with D3"
   },
   {
      "rawhtml": "<p>Yannick continue de nous faire part de ses expérimentations en ce qui concerne l’optimisation d’hyper-paramètres sur le channel Slack #veille-ML.</p><ul><li><a href=\"https://github.com/Yelp/MOE\">MOE</a> (Metrics Optimization Engine) est un outil qui optimise les paramètres d’un système. La formulation de cet outil est plus générale que le domaine de l’apprentissage artificiel. On utilise une interface REST pour communiquer avec, c’est donc a priori language-agnostic. Pour l’instant la première expérimentation a été faite en Python</li><li><a href=\"https://github.com/rsteca/sklearn-deap\">DEAP</a> est une librairie qui ajoute une couche d’optimisation d’hyper-paramètres à Scikit-Learn. Utilise un algorithme génétique pour faire l’optimisation. Pas encore testé par Quantmetry.</li></ul>",
      "date": "2016-02-15",
      "images": [],
      "tags": [],
      "title": "Hyper-Parameters Optimization"
   },
   {
      "rawhtml": "<p>Quelques ressources très générales sur les différents algorithmes ou sur les choix d’algorithmes d’apprentissage artificiel adaptés dans un contexte donné.</p><ul><li><a href=\"http://machinelearningmastery.com/a-tour-of-machine-learning-algorithms/\">A tour of Machine Learning Algorithms</a></li><li><a href=\"http://scikit-learn.org/stable/tutorial/machine_learning_map/\">Scikit-Learn cheat-sheet</a></li></ul><ul><li><a href=\"http://blog.dato.com/choosing-a-recommender-model\">Choosing the right recommender Model (blog post)</a></li></ul><p><img alt=\"decisiontree\" src=\"location/in/app\" /></p>",
      "date": "2016-02-15",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Choisir un algorithme / un modèle"
   },
   {
      "rawhtml": "<ul><li><a href=\"http://kateto.net/network-visualization\">Cet article</a> fournit un tutoriel détaillé pour afficher des réseaux / arbres en R. L’article va jusqu’à montrer comment intégrer des arbres interactifs dans R Studio. En terme de packages les ressources utilisées sont :<ul><li><a href=\"http://igraph.org/\">igraph</a></li><li><a href=\"https://cran.r-project.org/web/packages/sna/\">sna</a>, <a href=\"https://cran.r-project.org/web/packages/network/\">network</a> et <a href=\"https://cran.r-project.org/web/packages/ndtv/\">ndtv</a> qui semblent tous les trois issus de l’équipe de <a href=\"http://statnet.org/\">statnet</a></li></ul><li><a href=\"http://sachaepskamp.com/qgraph\">qgraph </a>est un package de visualisation de réseaux. Visiblement il est assez orienté vers la visualisation de corrélations entre variables. Voir <a href=\"http://psychosystems.org/network-model-selection-using-qgraph-1-3-10/\">ici</a> pour un tutorial.  </li><br /></p>",
      "date": "2016-02-15",
      "images": [
         "location/in/app",
         "location/in/app"
      ],
      "tags": [],
      "title": "Network Visualization in R"
   },
   {
      "rawhtml": "<p><a href=\"https://chriswarrick.com/blog/2016/02/10/deploying-python-web-apps-with-nginx-and-uwsgi-emperor/\">Cet article</a> est un tutoriel pour mettre en production une application Web écrite en Python (Django, Flask, Pyramid ou Bottle). Je pense que c’est article est utile pour passer d’une application qui est en test sur une QBox à une application en production sur un site externe et qui reçoit potentiellement de nombreuses requêtes. Le tutoriel utilise <a href=\"https://fr.wikipedia.org/wiki/Nginx\">nginx</a> et <a href=\"https://uwsgi-docs.readthedocs.org/en/latest/\">uWSGI</a>. </p>",
      "date": "2016-02-15",
      "images": [],
      "tags": [],
      "title": "Deploying a Python Web Application"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/kjw0612/awesome-rnn\">Cette page github</a> réunit un grand nombre de ressources utiles pour tout ce qui concerne le Deep Learning et les Réseaux de Neurones Récurrents. </p>",
      "date": "2016-02-15",
      "images": [],
      "tags": [],
      "title": "Awesome Recurrent Neural Networks"
   },
   {
      "rawhtml": "<p>Le Challenge 4 Cancer est un événement organisé par <a href=\"http://epidemium.cc/\">Epidemium</a> et sponsorisé par le laboratoire <a href=\"http://www.roche.fr/\">Roche</a> portant sur la thématique de l’épidémiologie du cancer. Les objectifs du Challenge sont:</p><ul><li>Exploiter des données ouvertes en rapport avec la santé et le territoire</li><li>Réunir des équipes pluridisciplinaires : médecins, statisticiens, développeurs…</li><li>Montrer la pertinence d’une approche d’exploitation systématique des données pour les enjeux de santé publique.</li></ul>",
      "date": "2016-02-29",
      "images": [],
      "tags": [],
      "title": "Epidemium et le Challenge 4 Cancer."
   },
   {
      "rawhtml": "<p><strong>Positionnement</strong> : le Challenge 4 Cancer comporte plusieurs catégories. Nous avons choisi de travailler sur l’axe de « Visualisation de l’évolution du cancer dans le temps et dans l’espace ». </p><p><strong>Résultat</strong>. Nous avons produit un site Web permettant de produire de manière simple un ensemble de visualisations des données disponibles dans  le cadre du Challenge. Une équipe de quatre personnes (Issam, Long, Stéphane et Benjamin) a travaillé pendant 2.5 jours pour fournir ce résultat. Les principales fonctionnalités du site sont :</p><ul><li>recherche et sélection des données que l’on veut représenter</li><li>visualisation interactive de données mono-variées et bi-variées</li><li>3 niveaux de segmentation : total / par âge / par sexe</li><li>courbe de tendance fournissant une prédiction pour les années futures.</li></ul>",
      "date": "2016-02-29",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Travail réalisé"
   },
   {
      "rawhtml": "<p>Ce projet était très motivant et nous espérons pouvoir capitaliser sur le travail fourni. Plusieurs pistes sont envisagées :</p><ul><li>Finaliser le site Web pour le montrer lors de <strong>Big Data Paris</strong></li><li><strong>Présentation</strong> du travail lors d’un Meetup Epidemium</li><li>Retour d’expérience <strong>méthodologique</strong>. Ce projet a constitué la première itération d’un projet de R&amp;D structuré comme une mission. Il serait intéressant de partager sur ce qui a fonctionné et ce qui était difficile</li><li>Retour d’expérience <strong>technique</strong>. Nous avons découvert et mis ensemble plusieurs briques technologiques que nous n’utilisons pas habituellement. Nous ferons sans doute une présentation à l’ensemble de l’équipe des choix réalisés.</li><li><strong>Développement d’un outil</strong> similaire qui pourrait être utilisé en mission. En particulier nous pensons qu’il serait intéressant de disposer d’un outil de visualisation interactif lors des démarrages de mission (phase d’analyse descriptive). Nous gagnerions du temps et nous pourrions permettre au client d’interagir directement avec ses données.</li></ul>",
      "date": "2016-02-29",
      "images": [],
      "tags": [],
      "title": "Développements futurs"
   },
   {
      "rawhtml": "<p>Git continue à être utile et nous continuons à être mal à l’aise dans son utilisation. Quelques éléments pour se rafraîchir la mémoire sur les bonnes pratiques.</p><ul><li><a href=\"https://gitlab.com/quantmetry/guidelines\">Guidelines</a> par Long sur notre repository, en particulier la section sur les <a href=\"https://gitlab.com/quantmetry/guidelines/blob/master/commiting.md\">commit</a>. </li><li>Tutorial expliquant la différence entre <a href=\"https://www.atlassian.com/git/tutorials/merging-vs-rebasing/workflow-walkthrough\">merge / rebase</a>.</li><li>Un <a href=\"https://medium.freecodecamp.com/understanding-git-for-real-by-exploring-the-git-directory-1e079c15b807\">article</a> qui décrit ce que contient exactement le répertoire .git</li></ul>",
      "date": "2016-02-29",
      "images": [],
      "tags": [],
      "title": "Quelques rappels sur GIT"
   },
   {
      "rawhtml": "<p>Spotify a créé une librairie pour la recherche approximée des plus proches voisins dans un dataset : <a href=\"https://github.com/spotify/annoy\">Annoy</a>.  C’est utile quand on veut générer une liste d’exemples similaires à partir d’un dataset contenant des millions d’entrées et des centaines de features. La librairie est en C++ et a une interface en <strong>Python</strong>. Visiblement quelqu’un a également créé une <a href=\"http://dirk.eddelbuettel.com/code/rcpp.annoy.html\">interface en R</a>.</p>",
      "date": "2016-02-29",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Recherche de voisins rapide"
   },
   {
      "rawhtml": "<p>Cet <a href=\"https://iamtrask.github.io/2016/02/25/deepminds-neural-stack-machine/\">article</a> est une sorte de tutoriel. Il explique comment prendre un article de recherche et le traduire en code. Une explication très détaillée et des commentaires des différentes équations utilisées. L’article utilisé comme exemple est un article de Google <em>: Learning to Transduce with Unbounded Memory</em> (<a href=\"http://papers.nips.cc/paper/5648-learning-to-transduce-with-unbounded-memory.pdf\">pdf</a>).</p>",
      "date": "2016-02-29",
      "images": [],
      "tags": [],
      "title": "How to Code and Understand DeepMind's Neural Stack Machine"
   },
   {
      "rawhtml": "<p>Article qui montre comment coder un réseau de neurones dans lequel les coefficients d’activation prennent des valeurs booléennes. On imagine bien sûr l’intérêt que cela peut représenter en terme de performance / d’occupation mémoire. <a href=\"http://arxiv.org/abs/1602.02830\">Article sur arXiv</a> et <a href=\"https://github.com/MatthieuCourbariaux/BinaryNet\">code sur github</a>. </p>",
      "date": "2016-02-29",
      "images": [],
      "tags": [],
      "title": "BinaryNet: Training Deep Neural Networks with Weights and Activations Constrained to +1 or -1"
   },
   {
      "rawhtml": "<p>Databricks a récemment sorti un package qui permet de profiter de l’architecture distribuée de Spark pour entrainer différents modèles Scikit Learn. Cela permet de diminuer grandement le temps d’optimisation des hyper-paramètres puisque les modèles peuvent être entraînés indépendamment. Voici un court <a href=\"https://databricks.com/blog/2016/02/08/auto-scaling-scikit-learn-with-spark.html\">article</a> qui montre un exemple simple d’utilisation du package. </p>",
      "date": "2016-02-29",
      "images": [],
      "tags": [],
      "title": "Scikit-Learn + Spark = ♥"
   },
   {
      "rawhtml": "<p>Ce genre de <a href=\"http://www.bloomberg.com/graphics/2015-measles-outbreaks/\">visualisation</a> qui se met à jour lorsqu’on parcourt la page web est très à la mode. Pour faire ça on peut utiliser la librairie Javascript <a href=\"http://1wheel.github.io/graph-scroll/\">graph_scroll.js</a> qui s’appuie elle-même sur <a href=\"https://github.com/mbostock/stack\">Stack</a> qui fait partie de D3.</p>",
      "date": "2016-02-29",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Créer une visualisation <em>scrollable</em>"
   },
   {
      "rawhtml": "<p>Expor package R qui s’appuie sur Shiny pour faire une exploration facile des données. Lien vers <a href=\"https://github.com/juba/explor\">github</a> et vers le <a href=\"https://cran.r-project.org/web/packages/explor/\">CRAN</a> index. Le package fait l’interface entre le résultat d’un calcul et la visualisation. Il a l’air particulièrement utilisé pour la visualisation d’une analyse multivariée (Principal Component Analysis, Correspondance Analysis, Multivariate Correspondance Analysis).  Ci-dessous un exemple de ce que le package fait. </p>",
      "date": "2016-03-14",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "R package for rapid data exploration"
   },
   {
      "rawhtml": "<p>Ce lien a peut-être été déjà partagé. Il s’agit d’une <a href=\"https://github.com/caesar0301/awesome-public-datasets\">collection de dataset</a> ouverts qui concernent une multitude de domaine (santé, énergie, climat…). Comme souvent la plupart des données seront focalisées sur le monde anglo-saxon. Pour rappel n’hésitez pas à passer sur <a href=\"https://www.data.gouv.fr/fr/\">data.gouv.fr</a> pour des données bien de chez nous. </p>",
      "date": "2016-03-14",
      "images": [],
      "tags": [],
      "title": "Une liste (de plus) de données ouvertes"
   },
   {
      "rawhtml": "<p><a href=\"http://blog.sigopt.com/post/140871698423/sigopt-for-ml-unsupervised-learning-with-even\">Cet article de blog</a> prend le cas pratique suivant : on veut faire une classification d’un ensemble d’image dont seulement une faible fraction est labellisée. Leur idée est d’utiliser un algorithme non supervisé pour grouper toutes les images puis un algorithme supervisé qui utilise les groupes et les quelques labels existants. Les deux algorithmes sont optimisés conjointement.</p><p>Le problème de l’article est qu’il est là pour mettre en avant une librairie commerciale de machine learning.</p>",
      "date": "2016-03-14",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Passer de supervisé à non supervisé avec une optimisation Bayésienne "
   },
   {
      "rawhtml": "<p>L’équipe du projet Epidemium a construit un pipeline de visualisation qui repose sur un server R (Plumber) et une librairie de visualisation (Plotly).<br /><a href=\"http://danielphadley.com/How-To-Dashboard-R/\">Cet article</a> propose une solution alternative pour obtenir un résultat similaire. Un script R génère une page html (package <a href=\"http://yihui.name/knitr/\">knitr</a>) et la visualisation est faire en javascript (librairie <a href=\"http://www.highcharts.com/\">Highcharts</a>). La limitation de la méthode présentée est que les graphiques en même temps que la page web et sont donc statiques. </p><p>Voici un exemple de visuel provenant du <a href=\"http://www.somervillema.gov/dashboard/daily.html\">site qu’ils ont fabriqué</a> avec ces technologies :</p>",
      "date": "2016-03-14",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Visualisation de données sur le Web à partir de R"
   },
   {
      "rawhtml": "<p>Une nouvelle version de Pandas vient de sortir ! Après un rapide coup d’œil les <a href=\"http://pandas.pydata.org/pandas-docs/stable/whatsnew.html\">modifications majeures</a> sont :</p><ul><li>meilleures fonctionnalités pour la gestion du texte (en particulier l’application d’une expression régulière à l’ensemble des éléments d’une série)</li><li>meilleure représentation d’une <a href=\"http://pandas.pydata.org/pandas-docs/stable/computation.html\">fenêtre de sélection</a>. Cette fenêtre de plusieurs lignes consécutives peut être utilisée pour le calcul de moyennes glissantes. Le formalisme est maintenant similaire à celui utilisé par la fonction .groupby()<ul><li>Trois types de fenêtres sont possible : .rolling()  .expanding()  et  .ewm()  - exponentially weighted window. </li><li>Plusieurs méthodes d’agrégation peuvent être appliquées à l’intérieur d’une fenêtre : somme, écart type, covariance, corrélation etc..</li></ul>",
      "date": "2016-03-14",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Pandas v0.18.0"
   },
   {
      "rawhtml": "<p><a href=\"http://rud.is/b/2016/03/16/supreme-annotations/\">Cet article de blog</a> montre comment exploiter les nouvelles fonctionnalités de ggplot2 pour créer de meilleures annotations sur un graphique. En particulier est décrit : </p><ul><li>création de titre / sous titre</li><li>création de note de « bas de page »</li><li>création d’annotations pour des points du graphique.</li></ul><p>Voici l’exemple généré dans ce tutoriel :</p><p><img alt=\"http://rud.is/dl/supremes.png\" src=\"location/in/app\" /></p>",
      "date": "2016-03-29",
      "images": [],
      "tags": [],
      "title": "Meilleures annotations de graphiques en R"
   },
   {
      "rawhtml": "<p><a href=\"http://arxiv.org/abs/1603.05279\">Cet article de revue</a> présente des résultats d’approximations de réseaux de neurones convolutionnels. Dans cette approximation, à la fois les données d’entrée et les poids du réseau sont considéré comme binaires. Les calculs de multiplication et d’addition sont remplacés par des opérations binaires. Toutes ces approximations résultent en :</p><ul><li>mémoire nécessaire divisée par 32</li><li>temps de calcul (sur CPU) divisé par 58</li></ul><p>Pour rappel, <a href=\"http://arxiv.org/abs/1602.02830\">un autre article de revue</a> décrivant une approximation similaire a été évoqué dans la Gazette du 29 Février.</p>",
      "date": "2016-03-29",
      "images": [],
      "tags": [],
      "title": "XNOR-Networks : des réseaux convolutionnels rapides"
   },
   {
      "rawhtml": "<p><a href=\"http://www.machinalis.com/blog/python-for-geospatial-data-processing/\">Cet article de blog</a> (<a href=\"https://github.com/machinalis/satimg/blob/master/classify.py\">github</a> correspondant) fait la démonstration d’une classification d’images satellitaires. Typiquement cette classification peut être utile dans le domaine de l’agriculture. L’article explique succinctement comment manipuler des données géo spatiales (images satellite + représentation vectorielles Shapefile) à l’aide de la librairie <a href=\"http://gdal.org/\">GDAL</a>.</p><p><img alt=\"http://www.machinalis.com/static/media/uploads/input-output.jpg\" src=\"location/in/app\" /></p>",
      "date": "2016-03-29",
      "images": [],
      "tags": [],
      "title": "Classification d’images satellite en Python"
   },
   {
      "rawhtml": "<p>PyData vient de rendre publique une <a href=\"https://www.youtube.com/playlist?list=PLGVZCDnMOq0rzDLHi5WxWmN5vueHU5Ar7\">série de vidéos</a> correspondant à leur récente conférence à Amsterdam. Quelques exemples de sujets :</p><ul><li><a href=\"https://www.youtube.com/watch?v=GFcFNccbDM8&amp;list=PLGVZCDnMOq0rzDLHi5WxWmN5vueHU5Ar7&amp;index=25\">Realtime Bayesian A-B testing with Spark Streaming</a></li><li><a href=\"https://www.youtube.com/watch?v=48WchucU8UY&amp;list=PLGVZCDnMOq0rzDLHi5WxWmN5vueHU5Ar7&amp;index=6\">From Data Science to Production - deploy, scale, enjoy!</a></li><li><a href=\"https://www.youtube.com/watch?v=XdksDmNsZ1Q&amp;list=PLGVZCDnMOq0rzDLHi5WxWmN5vueHU5Ar7&amp;index=13\">Store and manage data effortlessly with HDF5</a></li><li><a href=\"https://www.youtube.com/watch?v=YtsrshRAIRs&amp;list=PLGVZCDnMOq0rzDLHi5WxWmN5vueHU5Ar7&amp;index=19\">Using random search for efficient hyper-parameters optimization with H2O</a></li></ul>",
      "date": "2016-03-29",
      "images": [],
      "tags": [],
      "title": "PyData Videos"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/dodger487/dplython\">Ce repository</a> fournit une librairie Python qui permet d’utiliser la syntaxe de Dplyr (le package R de manipulation de données) sur des Dataframes Pandas. Personne n’en voulait mais maintenant ça existe !</p>",
      "date": "2016-03-29",
      "images": [],
      "tags": [],
      "title": "Enfin un pont entre deux communautés : Dplyr pour Python"
   },
   {
      "rawhtml": "<p>Il ne s’agit pas vraiment d’un article technique, mais plutôt méthodologique de la part de AirBnb. Dans <a href=\"https://medium.com/airbnb-engineering/scaling-knowledge-at-airbnb-875d73eff091\">cet article</a>, ils expliquent comment ils organisent la R&amp;D interne sous la forme de repositories qui permettent de reproduire des résultats passés. L’article manque de détails mais c’est peut être une idée qui peut nous inspirer.</p>",
      "date": "2016-03-29",
      "images": [],
      "tags": [],
      "title": "Idée de méthodologie: Knowledge Repository"
   },
   {
      "rawhtml": "<p>Le livre est actuellement <a href=\"http://www.deeplearningbook.org/\">publié en ligne</a> (pas dans le format le plus pratique d’utilisation).  Il a l’air de contenir des informations sur les développements récents dans la thématique des réseaux de neurones. Voici la liste des topics :</p>",
      "date": "2016-04-11",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Nouveau livre de référence sur le Deep Learning"
   },
   {
      "rawhtml": "<p>Le <a href=\"https://fr.coursera.org/learn/machine-learning\">cours de Andrew Ng sur Coursera</a> est <em>de facto</em> un point d’entrée pour beaucoup dans le monde de l’apprentissage artificiel. Les exercices sont par contre en Matlab / Octave qui ne sont pas toujours nos langages de prédilection. Quelqu’un a écrit toutes les solutions sous la forme de Notebooks Python, <a href=\"https://github.com/kaleko/CourseraML\">voici le repository</a>. </p>",
      "date": "2016-04-11",
      "images": [],
      "tags": [],
      "title": "Introduction en Machine Learning (Andrew Ng) – Solutions en Python"
   },
   {
      "rawhtml": "<p>Pendant un projet le code utilise de nombreux fichiers qui peuvent être répartis un peu partout dans le système de fichier de la machine (si QBox) ou de plusieurs machines. S’assurer que tous les fichiers sont accessibles quand on livre la version finale de l’application produite peut s’avérer difficile. Une solution possible est d’utiliser le package <a href=\"http://docs.pyfilesystem.org/en/latest/introduction.html\">PyFileSystem</a> qui créer une interface entre un système de fichier réel et un système de fichier virtuel compris par l’application. Voir <a href=\"https://www.willmcgugan.com/blog/tech/post/creating-a-virtual-filesystem-with-python-and-why-you-need-one/\">ici pour un rapide article</a> d’introduction. </p>",
      "date": "2016-04-11",
      "images": [],
      "tags": [],
      "title": "Un système de fichiers virtuel en Python"
   },
   {
      "rawhtml": "<p>Xavier a récemment tenu un journal-club concernant la sélection de variables. Un groupe de recherche a publié un ensemble d’algorithmes permettant de faire cette sélection. Leur travail est supposé s’interfacer simplement avec sklearn. Attention c’est pour python 2.7.  Vous trouverez <a href=\"http://featureselection.asu.edu/algorithms.php\">ici une liste d’algorithmes</a> et là <a href=\"https://github.com/jundongl/scikit-feature\">le package sur github</a> (pas de pip install). </p>",
      "date": "2016-04-11",
      "images": [],
      "tags": [],
      "title": "Sélection de variables en Python"
   },
   {
      "rawhtml": "<p>Des chercheurs de l’université de Californie ont <a href=\"http://www.nature.com/articles/srep21471\">récemment publié un article dans Nature</a> dans lequel ils expliquent le système de microscopie qu’ils ont développé pour la détection de cellules cancéreuses. Si on résume, voici ce que fait leur système :</p><ul><li>Capture d’image complexe avec un système de microscopie ad hoc (permet par exemple de mesurer le décalage en phase de la lumière qui passe à travers la cellule)</li><li>Création de features à partir de l’image : taille de la cellule, indice optique, circularité…</li><li>Utilisation d’un réseau de neurones entrainé pour faire la classification entre différentes catégories de cellules</li></ul><p>Bien que ça ne soit pas directement en lien avec l’article de recherche, je vous propose également la lecture de <a href=\"https://egtheory.wordpress.com/2016/04/21/automicroscopy/\">cet article de blog</a>. L’auteur donne une introduction à l’analyse d’images microscopique en Python (librairie OpenCV). </p>",
      "date": "2016-04-25",
      "images": [
         "location/in/app",
         "location/in/app"
      ],
      "tags": [],
      "title": "Microscopie + Machine Learning pour détecter des cellules cancéreuses"
   },
   {
      "rawhtml": "<p><a href=\"http://amunategui.github.io/anomaly-detection-h2o/index.html\">Ce tutoriel contient</a> un code source complet en R sur l’utilisation d’auto-encodeurs pour la détection d’outliers. L’article compare les performances de l’auto-encodeur à une forêt aléatoire. Les auto-encodeurs sont crée avec le model deeplearning de H2O. </p>",
      "date": "2016-04-25",
      "images": [],
      "tags": [],
      "title": "Détections d’anomalies avec des auto-encodeurs (R + H2O)"
   },
   {
      "rawhtml": "<p>Merci à Yannick de partager <a href=\"http://blog.datadive.net/prediction-intervals-for-random-forests/\">cet article de blog</a> qui montre comment calculer un intervalle de confiance quand on utilise des forêts aléatoires pour faire une régression. Grosso modo l’idée est simple : utiliser beaucoup d’arbres dans la forêt et regarder la distribution des réponses de ces différents arbres. Attention à faire la cross-validation de ces intervalles de confiance !  Quelques exemples de code en Python. (Je suis personnellement un peu dubitatif sur la méthodologie … à tester).</p>",
      "date": "2016-04-25",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Intervalles de confiance pour des régressions par forêts aléatoires"
   },
   {
      "rawhtml": "<p><a href=\"http://multithreaded.stitchfix.com/blog/2016/04/21/forget-arima/\">Cet article de Stitchfix</a> fait la recommandation d’utiliser des modèles Bayésiens pour analyser des séries temporelles. Les avantages principaux sont la transparence du modèle, la possibilité de calculer des intervalles de confiance pour la prédiction et la capacité d’intégrer des informations connues a priori (par le métier en général). </p><p>L’article contient des exemples en R qui utilisent le <a href=\"http://rpackages.ianhowson.com/cran/bsts/\">package bsts</a>. Pour info ce package est utilisé par <a href=\"http://www.r-bloggers.com/causalimpact-a-new-open-source-package-for-estimating-causal-effects-in-time-series/\">CausalImpact</a> qui permet de rechercher des effets causaux dans des séries temporelles.  Il y a également une comparaison avec des résultats obtenus avec ARIMA. </p>",
      "date": "2016-04-25",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Bayesian Structural Time Series"
   },
   {
      "rawhtml": "<p>Le sujet de la visualisation d’un jeu de données qui possède un très grand nombre de features a été récemment abordé sur #veille-ML. De manière générale, on va utiliser un algorithme de réduction de dimension (typiquement 2) et on va représenter le jeu de données dans ce nouvel espace. Voici quelques éléments pour démarrer l’investigation du sujet :</p><ul><li>Les premières méthodes qui sont mentionnées sont linéaires : Principal Component Analysis, Linear Discriminent Analysis. Ces méthodes on l’avantage d’être rapides mais peuvent rater des informations complexes (non linéaires) dans les données.</li><li>Manifold Learning (<a href=\"http://scikit-learn.org/stable/modules/manifold.html\">voir sur sklearn</a>) est un ensemble de méthodes non supervisées qui généralisent la réduction de dimension dans une approche non-linéaire. Parmi celles-ci, <a href=\"http://scikit-learn.org/stable/modules/manifold.html\">t-distributed Stochastic Neighbor Embedding</a> semble être ce qui est souvent recommandé.</li><li><a href=\"https://arxiv.org/abs/1602.00370\">Cet article de recherche</a> récent propose une méthode de représentation du jeu de données (LargeVis) qui consiste à calculer un graph des k plus proches voisins et représenter ce graph. Il semblerait que cette méthode soit plus rapide que t-SNE pour des grands jeux de données. Vous <a href=\"https://sites.google.com/site/pkujiantang/big-data-visualization\">trouverez ici</a> quelques slides et (prochainement) le code correspondant. </li></ul>",
      "date": "2016-05-09",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Visualiser des données multidimensionnelles"
   },
   {
      "rawhtml": "<p>Python fournit la librarie <a href=\"https://docs.python.org/3.5/library/multiprocessing.html\">multiprocessing</a> qui permet de tirer profit des nombreux cœurs des processeurs de nos QBox préférées. Cependant il peut être un peu lourd d’écrire le code pour en tirer partie : il faut manuellement gérer une Pool de processes, vérifier l’accès de chaque process à un objet de données commun.. La <a href=\"http://alex.vector57.net/deco/\">librairie DECO</a> propose deux décorateurs qui semblent suffisant pour gérer toutes ces complications<a href=\"https://drive.google.com/file/d/0B_olmC0u8E3gWTBmN3pydGxHdEE/view\">. Voir ici</a> pour un article qui explique la démarche utilisée. Passer à plusieurs cœurs en <strong>2 lignes de codes</strong> c’est tentant, non ?</p>",
      "date": "2016-05-09",
      "images": [],
      "tags": [],
      "title": "Python : Multiprocessing made easy"
   },
   {
      "rawhtml": "<p>Bonne nouvelle ! O’Reilly étend sa collection d’ouvrage de référence. Pas encore parus, mais gardez-leur une place dans la bibliothèque !</p><br /></p>",
      "date": "2016-05-09",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Nouveaux livres de Machine Learning / Statistiques"
   },
   {
      "rawhtml": "<p>Voici deux articles qui montrent des exemples d’utilisation de la librairie de réseaux de neurones de Google :</p><ul><li><a href=\"http://matthewearl.github.io/2016/05/06/cnn-anpr/\">Le premier</a> prend pour exemple l’identification de la plaque d’immatriculation à partir de photos. Il s’appuie pour cela sur <a href=\"http://static.googleusercontent.com/media/research.google.com/en//pubs/archive/42241.pdf\">l’article de Google</a> sur l’identification des numéros de maison de StreetView. L’auteur propose une méthode intéressante pour générer automatiquement des images qui servent à entraîner le modèle.</li><li><a href=\"http://danijar.github.io/introduction-to-recurrent-networks-in-tensorflow\">Le deuxième</a> est plus succinct ; il s’agit d’un exemple de classification de séquences en utilisant des réseaux récurrents, en particulier des Long Term Short Memory (LSTM). <a href=\"http://colah.github.io/posts/2015-08-Understanding-LSTMs/\">Voir ici pour un article</a> qui explique simplement ce que sont les réseaux LSTM.</li></ul>",
      "date": "2016-05-09",
      "images": [],
      "tags": [],
      "title": "Exemples d’utilisation de TensorFlow"
   },
   {
      "rawhtml": "<p>La détection de « Topic » est utile dans l’analyse de texte car cela permet de synthétiser des documents textuels dans un espace à peu de dimension. En python, la <a href=\"https://radimrehurek.com/gensim/wiki.html\">librairie Gensim</a> permet de mettre en place facilement ce genre d’analyse. Une méthode fréquemment utilisée est la Latent Dirichlet Analysis (LDA).</p><p>Les topics sont en général appris une fois (sur une partie du corpus) et les nouveaux documents analysés sont projetés dans cet espace. On peut se poser la question de la déviation dans le temps des topics. Est ce que chaque sujet reste pertinents dans le temps ? De même comment faire pour apprendre les topics sur deux sous-ensembles distincts du corpus ? C’est à ce genre de questions qu’essaie de répondre <a href=\"http://www.hpl.hp.com/techreports/2010/HPL-2010-158.pdf\">cet article de recherche</a>.</p>",
      "date": "2016-06-06",
      "images": [],
      "tags": [],
      "title": "Topic Modeling  Ensembles"
   },
   {
      "rawhtml": "<p>Dans <a href=\"http://multithreaded.stitchfix.com/blog/2016/05/27/lda2vec/\">cet article</a>, une méthode est présentée qui est décrite comme intermédiaire entre LDA et word2vec. Leur argumentaire est que :</p><ul><li>LDA : bien pour permettre à un humain d’interpréter un corpus non labellisé</li><li>Word2vec : bien pour permettre à un algorithme de faire des prédictions</li></ul><p>La solution proposée pioche un peu dans les deux mondes. En plus de l’article de vulgarisation, il y a un <a href=\"https://arxiv.org/abs/1605.02019\">article de recherche</a>, du <a href=\"https://github.com/cemoody/lda2vec\">code sur github</a> et de la <a href=\"http://lda2vec.readthedocs.io/en/latest/\">documentation</a>. </p>",
      "date": "2016-06-06",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Topic Modeling : mixing LDA and word2Vec"
   },
   {
      "rawhtml": "<p>Dans l’utilisation classique de Word2Vec, on est sensible à la polysémie : un même mot peut avoir plusieurs significations différentes. Sens2Vec cherche à palier à ce manquement. <a href=\"https://spacy.io/blog/sense2vec-with-spacy\">Cet article</a> montre un exemple d’utilisation. Voici <a href=\"http://arxiv.org/abs/1511.06388\">un article de recherche</a> présentant la démarche. Word2Vec fait partie de <a href=\"https://spacy.io/\">spaCy qui est une librairie python pour le Traitement du Langage Naturel</a>. A explorer : ils se vantent de très bonnes performances !</p>",
      "date": "2016-06-06",
      "images": [],
      "tags": [],
      "title": "Sense2Vec : plus fin que Word2Vec"
   },
   {
      "rawhtml": "<p>Dans l’idée de rendre nos codes plus « industriels », il est important d’adopter des conventions en terme de <strong>logging</strong>. Voici <a href=\"http://victorlin.me/posts/2012/08/26/good-logging-practice-in-python\">un article</a> qui donne quelques conseils sur les outils et les configurations à utiliser.</p>",
      "date": "2016-06-06",
      "images": [],
      "tags": [],
      "title": "Utilisation d’un système de log plutôt que du print()"
   },
   {
      "rawhtml": "<p>Je ne sais pas si c’est un vrai problématique pour nous… Mais peut être que certains consultants ont déjà mis en place des architectures de réseaux de neurones avec Theano et pas Tensorflow. <a href=\"https://medium.com/@sentimentron/faceoff-theano-vs-tensorflow-e25648c31800\">Cet article donne quelques conseils</a> pour passer du premier au deuxième. Ça peut servir de tutoriel dans tous les cas. L’exemple considéré est le tagging de séquences textuels (traitement lettre par lettre et couches LSTM Long Short Term Memory).</p>",
      "date": "2016-06-06",
      "images": [],
      "tags": [],
      "title": "Passer de Theano à TensorFlow"
   },
   {
      "rawhtml": "<p>Le Notebook continue à être un outil beaucoup utilisé et son développement est toujours actif. La prochaine version sera le <a href=\"http://blog.jupyter.org/2016/07/14/jupyter-lab-alpha/\">Jupyter Lab</a> qui est actuellement en version alpha. Cette version ressemblera davantage à un environnement de développement complet. C’est Long qui va être content ! </p>",
      "date": "2016-07-18",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Ipython -&gt; Jupyter Notebook -&gt; Jupyter Lab !"
   },
   {
      "rawhtml": "<p>Vous avez dejà peut être utilisé la librairie <a href=\"https://github.com/scrapy/scrapely\">Scrapy</a> (Scrapely ?) pour extraire des informations automatiquement de nombreuses pages Web. <a href=\"https://blog.scrapinghub.com/2016/07/07/scrapely-the-brains-behind-portia-spiders/\">Portia</a> est un outil qui permet de configurer un scraper visuellement. Il faut s’inscrire pour utiliser une version déjà installée, mais on peut l’installer soi-même, c’est un projet <a href=\"https://github.com/scrapinghub/portia\">open-source</a>. </p>",
      "date": "2016-07-18",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Web Scraping"
   },
   {
      "rawhtml": "<p><a href=\"http://jcrist.github.io/dask-sklearn-part-1.html\">Cet article de blog</a> prend un cas d’application standard de la parallélisation de modèles : le GridSearch. La gestion du parallélisme d’appuie sur <a href=\"http://dask.pydata.org/en/latest/\">Dask</a>, un librairie qui créé des graphes de calculs et les optimise avant de lancer ces calculs de manière parallélisée (voire distribuée). Dask fait partie de l’écosystème <a href=\"http://blaze.pydata.org/\">Blaze</a>. </p>",
      "date": "2016-07-18",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Apprentissage en parallèle"
   },
   {
      "rawhtml": "<p><a href=\"http://www.rage.net/~greg/2016-07-05-ActorCritic-with-OpenAI-Gym.html\">Cet article de blog</a> montre un exemple d’apprentissage par renforcement. L’artillerie lourde est Keras mais l’auteur utilise pour évaluer ses modèles une librairie spécifique à l’apprentissage par renforcement : <a href=\"https://gym.openai.com/docs\">OpenAI Gym</a>. </p><p>Pour un tutoriel plus complet, vous pouvez également consulter <a href=\"http://outlace.com/Reinforcement-Learning-Part-1/\">cet article</a>, et si c’est un bouquin qui vous intéresse, <a href=\"https://webdocs.cs.ualberta.ca/~sutton/book/ebook/the-book.html\">Reinforcement Learning, An Introduction (Sutton, 1998</a>) est disponible en ligne. </p>",
      "date": "2016-07-18",
      "images": [],
      "tags": [],
      "title": "Apprentissage par renforcement"
   },
   {
      "rawhtml": "<p>La librairie <a href=\"https://github.com/RJT1990/pyflux\">PyFlux</a> est spécialisée dans l’analyse et la prédiction de séries temporelle. Elle met à disposition un certain nombre de modèles au noms imprononçables :</p><ul><li>ARIMA</li><li>GARCH / EGARCH</li><li>GAS model</li><li>VAR model</li></ul>",
      "date": "2016-08-16",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Librairie Python : Séries temporelles"
   },
   {
      "rawhtml": "<p>Après Theano, Tensor Flow, Keras, Lasagne, Caffe vous trouvez sûrement qu’il vous manque encore une librairie d’apprentissage profond ! Ne paniquez plus il existe également <a href=\"https://github.com/nervanasystems/neon\">Neon</a> publié par Nervana (Nervana fournit une plateforme de machine learning et vient d’être acheté 300 Millions par Intel.. leur librairie ne doit pas être mauvaise quand même).</p>",
      "date": "2016-08-16",
      "images": [],
      "tags": [],
      "title": "Librairie Python : Encore du Deep Learning"
   },
   {
      "rawhtml": "<p>Asyncpg est un driver Python pour PostgreSQL qui s’appuie sur le framework <a href=\"https://docs.python.org/3/library/asyncio.html\">asyncio</a> (qui fait partie de la librairie standard pour l’instant). Les développeurs de la librairie promettent des performances de compétition. Voir <a href=\"https://github.com/magicstack/asyncpg\">ici pour le github</a> et <a href=\"https://magic.io/blog/asyncpg-1m-rows-from-postgres-to-python/\">là pour un article</a> qui décrit l’intérêt de la librairie. </p>",
      "date": "2016-08-16",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Librairie Python : Un driver pour PostgreSQL"
   },
   {
      "rawhtml": "<p>Voici trois articles / tutoriels qui peuvent être intéressants. </p><ul><li><a href=\"http://noamelf.com/2016/08/05/designing-pythonic-apis/\">Création d’une API agréable à utiliser</a>. Cet article compare deux librairies python (urllib et requests) pour mettre en évidence comment le design réfléchi de la librairie peut améliorer son ergonomie. </li><li><a href=\"http://blog.yhat.com/posts/estimating-user-lifetimes-with-pymc.html\">Analyse de Survie.</a> Cet article illustre de manière claire quelques erreurs à éviter lorsqu’on fait une analyse de survie (notamment la notion de censure). </li><li><a href=\"http://adilmoujahid.com/posts/2016/08/interactive-data-visualization-geospatial-d3-dc-leaflet-python/\">Construction d’une application web avec graphiques et cartographie.</a> Le totoriel est un peu rapide mais l’auteur pointe vers deux applications exemples qu’il a réalisé. Je choisi celui-ci car c’est assez proche des choix que nous avons fait à la SNCF pour le développement d’une appli web.</li></ul>",
      "date": "2016-08-16",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Tutoriels Variés"
   },
   {
      "rawhtml": "<p>EtaLab met à disposition un jeu de donné permettant de faire la correspondance entre une adresse postale et un localisation géographique. Le dataset contient <strong>25 Millions d’adresses en France</strong> et dispose même d’une <a href=\"http://adresse.data.gouv.fr/api/\">API</a> si vous souhaitez requêter quelques adresses. <a href=\"http://adresse.data.gouv.fr/\">Site pour demander les données.</a> <a href=\"https://www.data.gouv.fr/fr/datasets/ban-base-adresse-nationale/\">Liens vers la documentation</a>. </p>",
      "date": "2016-08-29",
      "images": [],
      "tags": [],
      "title": "Base Adresse Nationale"
   },
   {
      "rawhtml": "<p>Le scraping d’un site est parfois un bon moyen de récupérer des données. Il faut cependant être vigilent à ne pas perturber l’activité du site. Voici <a href=\"https://blog.scrapinghub.com/2016/08/25/how-to-crawl-the-web-politely-with-scrapy/\">quelques règles de politesses</a> (implémentées avec Scrapy) :</p><ul><li>Respecter le robot.txt</li><li>Limiter les requêtes</li><li>Fournir son identité</li></ul>",
      "date": "2016-08-29",
      "images": [],
      "tags": [],
      "title": "Web Scraping : Quelques règles à respecter"
   },
   {
      "rawhtml": "<p><a href=\"http://arxiv.org/pdf/1509.02971v2.pdf\">Cet article présente</a> une méthode d’apprentissage par renforcement qui utilise un réseau de neurones profond. L’évolution par <a href=\"http://www.nature.com/nature/journal/v518/n7540/full/nature14236.html\">rapport aux précédentes versions</a> est d’être appliqué à un espace des actions continu. Par exemple pour la conduire une voiture, l’algorithme peut faire l’apprentissage de « accélération à x % » et pas seulement « accélération Oui/Non ». Voir <a href=\"http://pemami4911.github.io/blog_posts/2016/08/21/ddpg-rl.html\">ici pour une version plus abordable</a> de l’article et des exemples (tensorFlow)</p>",
      "date": "2016-08-29",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Deep Deterministic Policy Gradients"
   },
   {
      "rawhtml": "<p> <a href=\"https://vega.github.io/\">Vega</a> est une grammaire de visualisation de données. Les graphiques sont décrits par un dictionnaire (similaire à Plotly) décrivant à bas niveau ce que contient le graphique. L’affichage des graphiques est a priori réalisé par D3.js.</p><p><a href=\"https://vega.github.io/vega-lite/\">Vega-Lite</a> s’appuie sur Vega et est plus haut niveau, plus simple à utiliser. Le tradeoff est une perte de généralité (tous les graphiques ne peuvent pas être représenté par Vega-Lite). </p><p><a href=\"https://github.com/ellisonbg/altair\">Altair</a> est une librairie Python qui permet de générer une description de graphique Vega-Lite. L’utilisation est très simple (un peu similaire à ggplot2). (<a href=\"https://www.youtube.com/watch?v=aRxahWy-ul8\">Vidéo de présentation de Altair</a> à la dernière PyData)</p><p>L’équipe de Vega a également réalisé trois applications qui permettent de créer des visualisations :</p><ul><li><a href=\"https://idl.cs.washington.edu/projects/lyra/\">Lyra</a> pour créer des visualisation complexes</li><li><a href=\"http://vega.github.io/polestar/\">Polestar</a> pour des choses simples (Altair est dans ce cas plus pratique d’utilisation il me semble)</li><li><a href=\"http://vega.github.io/voyager/\">Voyager</a> qui fournit des suggestions de visualisations. Peut être intéressant à utiliser dans la phase d’exploration des données. </li></ul>",
      "date": "2016-08-29",
      "images": [],
      "tags": [],
      "title": "Visualisation avec la stack Vega"
   },
   {
      "rawhtml": "<p>Facebook vient de rendre open source deux algorithmes qu’ils utilisent pour faire de la détection d’objets dans des images : <a href=\"http://arxiv.org/abs/1506.06204\">DeepMask</a> et <a href=\"http://arxiv.org/abs/1603.08695\">SharpMask</a>. Le <a href=\"https://github.com/facebookresearch/deepmask\">repository est sur github</a>. Ils fournissent une version <strong>déjà entrainée</strong> de l’algorithme. Attention par contre il ne s’agit pas d’attribuer une classe aux objets mais simplement <strong>de détecter leurs contours</strong>.</p>",
      "date": "2016-09-12",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Facebook : DeepMask + SharpMask"
   },
   {
      "rawhtml": "<p><a href=\"http://distill.pub/2016/augmented-rnns/\">Un bon article de blog</a> qui parle de techniques avancées d’utilisations des RNN. Je ne suis pas sûr que ces techniques soient facilement exploitables dans ce qu’on fait mais ça peut être intéressant. ",
      "date": "2016-09-12",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Architectures avancés de réseaux récurrents"
   },
   {
      "rawhtml": "<p><a href=\"http://opennex.planetos.com/gddp\">Un outil en ligne</a> qui permet d’accéder à une ressource incroyable : des données climatiques géolocalisées à une <strong>résolution de 25 km depuis 1950 partout dans le monde</strong> ! Voir plus <a href=\"https://planetos.com/blog/opennex-climate-data-access-tool/?utm_source=twitter&amp;utm_medium=tweet&amp;utm_campaign=20160901-opennex\">d’informations sur ce site</a>. Par contre j’ai l’impression qu’on ne télécharge pas directement les données mais un Docker qui contient les données.. A voir. J’ai l’impression que les données contiennent également <strong>des prédictions climatiques</strong> sur les prochaines années. </p>",
      "date": "2016-09-12",
      "images": [],
      "tags": [],
      "title": "DataSet : climat mondial"
   },
   {
      "rawhtml": "<p>Deux articles de blog qui peuvent être utiles lors d’une mise en production d’une application Python complexe. Ces articles expliquent comment <a href=\"http://www.fullstackpython.com/blog/send-sms-text-messages-python.html\">envoyer des SMS</a> et faire des <a href=\"http://www.fullstackpython.com/blog/dial-outbound-phone-calls-python-bottle.html\">appels téléphoniques</a> depuis Python. Le service repose sur <a href=\"https://www.twilio.com/\">Twilio</a>. </p>",
      "date": "2016-09-12",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Téléphoner en Python"
   },
   {
      "rawhtml": "<p>Django et Flask sont les librairies de référence pour construire un back-end en Python. Pour être clair ça permet de construire une page html qui dépend de la requête de l’utilisateur (ex : la liste de produits détenus par un client sous la forme d’une table HTML). Pour réaliser une application avec beaucoup d’interactivité (ex : quand on clique sur un produit on a une courbe d’évolution de la valeur de ce produit au cours du temps), on va généralement placer une partie du code dans le front-end ; a priori en Javascript.</p><p><a href=\"https://github.com/metaperl/python-oop/blob/master/README.md\">Certaines librairies Python</a> permettent de réaliser des applications (<a href=\"https://github.com/thomasantony/flybywire\">simples</a>) avec un peu d’intéractivité : des sliders, sélecteurs, etc sans avoir à code en Javascript. La dernière en date est <a href=\"https://github.com/thomasantony/flybywire\">flybywire</a>. Notons que <a href=\"http://bokeh.pydata.org/en/latest/docs/gallery.html\">bokeh</a> permet également de réaliser des dashboards interactifs pour de la visualisation de donnée. </p>",
      "date": "2016-09-12",
      "images": [],
      "tags": [],
      "title": "Python pour le front-end ?"
   },
   {
      "rawhtml": "<p>Quelqu’un est en train de construire un package R pour faciliter l’intégration de visualisations en D3.js. Voir <a href=\"http://www.buildingwidgets.com/blog/2016/8/28/why-d3r\">ici pour un article</a> qui explique ses motivations et là pour le <a href=\"https://github.com/timelyportfolio/d3r\">repository</a>.  </p>",
      "date": "2016-09-12",
      "images": [],
      "tags": [],
      "title": "Utilisation de D3.js en R"
   },
   {
      "rawhtml": "<p>Avec un souvenir amer de l’appel d’offre Trace Wifi, voici quelques pistes si l’occasion se représente. Ces deux librairies permettent de géolocaliser un téléphone mobile au sein d’un bâtiment contenant plusieurs émetteurs WiFi. Ils fonctionnent de manière supervisée : l’algorithme apprend à faire correspondre un vecteur de signaux dans l’espace des émetteurs à une pièce du bâtiment. </p><ul><li><a href=\"CAZ_COMPATIBLE%20SOPHIA%20V2%20UNIQUEMENT_V3.0-F%C3%A9vrier2016_BENJAMIN_HABERT\">Find</a>, une librairie en Go mais avec de nombreuses informations</li><li><a href=\"https://github.com/kootenpv/whereami\">Whereami</a>, son équivalent Python (mais très succint)</li></ul>",
      "date": "2016-09-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "WiFi Indoor Location"
   },
   {
      "rawhtml": "<p>La librairie <a href=\"http://pomegranate.readthedocs.io/en/latest/\">Pomegranate</a> donne accès à un certain nombre de méthodes de modélisation probabiliste :</p><ul><li>Naive Bayes</li><li>Hidden Markov Model</li><li>Bayesian Networks</li></ul><p>L’auteur de la librairie a donné une <a href=\"https://www.youtube.com/watch?v=YBknijEiABA\">présentation au dernier PyData</a> (Chicago, il y a quelques jours). </p>",
      "date": "2016-09-27",
      "images": [],
      "tags": [],
      "title": "Probabilistic Modeling en Python"
   },
   {
      "rawhtml": "<p>L’installation des frameworks de deep learning est toujours problématique, en particulier sur GPU. <a href=\"https://blogs.technet.microsoft.com/machinelearning/2016/09/15/building-deep-neural-networks-in-the-cloud-with-azure-gpu-vms-mxnet-and-microsoft-r-server/\">Cet article</a> est un ensemble détaillé d’instructions pour l’installation de MXNet sur Microsoft Azure avec utilisations de GPUs. </p>",
      "date": "2016-09-27",
      "images": [],
      "tags": [],
      "title": "Installation de MXNet"
   },
   {
      "rawhtml": "<p><a href=\"http://www.asimovinstitute.org/neural-network-zoo/\">Ce site</a> donne une brêve description de nombreuses architectures typiques de réseaux de neurones. Pratiques quand on a oublié la différence entre une Liquid State Machine et une Extreme Learning Machine !</p>",
      "date": "2016-09-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Neural Network CheatSheet"
   },
   {
      "rawhtml": "<p>L’installation des packages de deep learning peut être compliquée ; surtout pour la configuration de la carte graphique. Ce <a href=\"https://github.com/Miej/GoDeeper\">repository</a> explique comment utiliser une image d’instance pré-construite avec les bonnes configurations.   </p>",
      "date": "2016-11-07",
      "images": [],
      "tags": [],
      "title": "Instance Amazon pour du Deep Learning"
   },
   {
      "rawhtml": "<p>Le <a href=\"https://github.com/blue-yonder/tsfresh\">module Python tsfresh</a> permet de construire facilement des features de séries temporelles. C’est utile si l’on veut utiliser les séries temporelles pour faire de la classification par exemple. Un série est « résumée » en un certains nombre de caractéristiques et ce sont ces caractéristiques qui deviennent les features du modèle prédictif. </p>",
      "date": "2016-11-07",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Construction de features pour des séries temporelles"
   },
   {
      "rawhtml": "<p>Une closure est une fonction créée en même temps qu’un contexte qui lui est spécifique. En générale on utilise une fonction qui génère cette fonction avec son contexte spécifique. C’est souvent utilisé en Javascript pour les callbacks. Voici <a href=\"http://www.discoversdk.com/blog/closures-in-python-3\">un article</a> qui explique comment créer des closures en Python et quelles erreurs courantes sont à éviter. </p>",
      "date": "2016-11-07",
      "images": [],
      "tags": [],
      "title": "Les closures en Python"
   },
   {
      "rawhtml": "<p>Pour préparer le Journal Club d’Aleksander, voici un <a href=\"http://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003833\">article</a> (<a href=\"http://journals.plos.org/ploscompbiol/article/asset?id=10.1371/journal.pcbi.1003833.PDF\">pdf</a>) qui fournit des règles simples à suivre pour produire de meilleures figures scientifiques. Quelques exemples de points abordés sont : choix du message, utilisation de la couleur, adaptation au medium utilisé. </p><p>Figure 1: Parmis ces deux graphiques, lequel est adapté à une publication écrite? à une présentation powerpoint ?</p>",
      "date": "2016-11-07",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Visualisations : 10 règles pour produire de meilleures figures"
   },
   {
      "rawhtml": "<p>Imaginez une application qui repose sur deux composants : le premier fournit des sources de données brutes et le deuxième fait des transformations sur ces données. Dans le contexte d’une application web, il est probable que la donnée soit échangée entre ces deux composants via des requêtes REST. Si l’on souhaite réaliser les traitements en Pandas, il faut trouver un moyen d’envoyer et recevoir les DataFrames sérialisés. Cet <a href=\"http://www.machinalis.com/blog/pandas-django-rest-framework-bokeh/\">article</a> présente un exemple : la sérialisation est faite avec le package <a href=\"https://github.com/abarto/pandas-drf-tools\">pandas-drf-tools</a>. Le code de l’exemple est disponible <a href=\"https://github.com/abarto/pandas-drf-tools-test\">ici</a>. </p>",
      "date": "2016-11-07",
      "images": [],
      "tags": [],
      "title": "Requêter des DataFrames Pandas avec un API REST"
   },
   {
      "rawhtml": "<p>Voici <a href=\"http://www.bigeng.io/elasticsearch-scaling-multitenant/\">un article</a> qui décrit comment un architecture distribuée basée sur ElasticSearch a été optimisée. Il s’agit d’un gros cluster de 23 nœuds et 60 shards ; a priori bien au delà de ce qu’on rencontre. Mais c’est intéressant de voir comment ils ont diagnostiqué le système pour l’améliorer. </p>",
      "date": "2016-11-21",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Diagnostics et Optimisation de ElasticSearch en production"
   },
   {
      "rawhtml": "<p><a href=\"http://sebastianraschka.com/blog/2016/model-evaluation-selection-part3.html\">Cet article</a> est le troisième d’une série sur l’évaluation des modèles de machine learning. Celui-ci porte sur la validation croisée et l’optimisation des hyper paramètres. Comme pour les deux article précédent les illustrations sont de qualité et facilitent la compréhension. </p>",
      "date": "2016-11-21",
      "images": [],
      "tags": [],
      "title": "Evaluation des modèles : un tutoriel très complet"
   },
   {
      "rawhtml": "<p>Un générateur de site statique est un programme qui prend en entrée le contenu du site sous une forme lisible par un humain (typiquement : un ensemble de pages en Markdown) et le converti en un ensemble de pages HTML. Pour publier le site web il ne reste plus qu’à placer l’ensemble des fichiers sur un serveur ou d’utiliser un Content Delivery Network qui garanti un chargement des pages très rapide. Il existe plusieurs générateurs de site écrit en Python : <a href=\"http://blog.getpelican.com/\">Pelican</a>, <a href=\"https://www.getlektor.com/\">Lektor</a>, <a href=\"https://getnikola.com/\">Nikola</a>. Parce que cette méthode est facile à utiliser <a href=\"https://www.smashingmagazine.com/2015/11/modern-static-website-generators-next-big-thing/\">elle est devenue populaire</a> ces dernières années. </p><p>Cette méthode se différencie d’un site avec une gestion de contenu (CMS) où le serveur doit faire des requêtes en base pour construire à la volée la page qui est requêtée (c’est ce que fait Django ou Flask). </p>",
      "date": "2016-11-21",
      "images": [],
      "tags": [],
      "title": "Static Website Generators"
   },
   {
      "rawhtml": "<p>Il y a eu récemment des progrès sur la traduction parole -&gt; texte. <a href=\"http://blogs.microsoft.com/next/2016/10/18/historic-achievement-microsoft-researchers-reach-human-parity-conversational-speech-recognition/\">Microsoft annonce</a> une méthode qui est aussi performante que des professionnels (<a href=\"https://arxiv.org/abs/1610.05256\">article</a>). Mais on peut encore aller plus loin : reconnaître ce qui est dit par lecture sur les lèvres : pas besoin du son, seulement de la vidéo. Voici <a href=\"https://www.youtube.com/watch?v=5aogzAUPilE\">une démo</a> et <a href=\"https://arxiv.org/abs/1611.05358\">l’article correspondant</a>. Très impressionnant techniquement et <a href=\"http://ctj.org/images/2014/googleevil.jpg\">pas inquiétant</a> du tout. </p>",
      "date": "2016-11-21",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Reconnaissance de la parole."
   },
   {
      "rawhtml": "<p>Google a sorti un outil de visualisation similaire à Tableau. <a href=\"https://www.google.com/analytics/data-studio/gallery/\">Data Studio</a> permet de créer des dashboards simples que l’on peut partager. Une version gratuite est disponible. L’outil a l’air orienté particulièrement pour l’écosystème Google (connexions avec Adwords, Analytics, Big Query, etc.). ",
      "date": "2016-11-21",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Nouvel outil de visualisation par Google"
   },
   {
      "rawhtml": "<p>Une manière usuelle d’exposer les résultats d’un modèle de machine learning est de construire une API de prédiction : cette API retourne la prédiction quand on lui envoie les features d’un exemple. <a href=\"https://blog.metaflow.fr/tensorflow-how-to-freeze-a-model-and-serve-it-with-a-python-api-d4f3596b3adc\">Cet article de blog</a> explique comment réaliser cette API en Flask en utilisant un modèle Tensorflow sauvegardé après avoir été entraîné. </p><p>Notes :</p><ul><li><a href=\"http://bottlepy.org/docs/dev/\">Bottle.py</a> est parfois plus simple que Flask pour des petits projets</li><li>Sklearn <a href=\"http://scikit-learn.org/stable/modules/model_persistence.html\">permet également de sauvegarder</a> des modèles entraînés</li></ul>",
      "date": "2016-11-21",
      "images": [],
      "tags": [],
      "title": "Mettre un modèle derrière une API"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/deepgraph/deepgraph\">La librairie Deepgraph</a> permet de définir et modifier des Graphs en tant que DataFrames Pandas. La librairie ne dispose pas pour le moment de beaucoup de fonctions analytiques. Elle permet cependant de convertir les graphs dans d’autres représentations (matrices creuses de Scipy, graphs de NetworkX ou graph_tools). Deepgraph fournit également quelques outils de visualisations de réseaux. </p>",
      "date": "2016-11-21",
      "images": [],
      "tags": [],
      "title": "Analyse de Graphs avec Pandas"
   },
   {
      "rawhtml": "<p>Dans la jungle des librairies de DeepLearning, Quantmetry n’a toujours pas choisi sa librairie de référence. Amazon ne nous a pas attendu <a href=\"http://www.allthingsdistributed.com/2016/11/mxnet-default-framework-deep-learning-aws.html\">et a arrêté</a> son choix sur <a href=\"http://mxnet.io/api/python/index.html\">MXNet</a>. Cela veut surement dire que cette librairie sera dans le futur la plus simple à utiliser sur les instances AWS. Rappelons cependant qu’il est possible de louer une <a href=\"https://aws.amazon.com/marketplace/pp/B01M0AXXQB\">instance pré-installée</a> pour le DeepLearning (MXNet, Caffe, Tensorflow, Theano, Torch and CNTK). </p>",
      "date": "2016-11-21",
      "images": [],
      "tags": [],
      "title": "DeepLearning sur AWS : MXNet"
   },
   {
      "rawhtml": "<p>Une précédente édition de la Newsletter abordait le thème des closures (ces fonctions qui mémorisent le scope dans lequel elles ont été créées) avec <a href=\"http://www.discoversdk.com/blog/closures-in-python-3\">cette article</a>. Pour approfondir voici <a href=\"http://www.informit.com/articles/article.aspx?p=2354943\">un autre article</a> de meilleur qualité. </p>",
      "date": "2016-11-21",
      "images": [],
      "tags": [],
      "title": "Retour sur les closures en Python"
   },
   {
      "rawhtml": "<p><a href=\"http://mapinseconds.com/\">Cet outil</a> en ligne promet de vous aider à générer une carte en quelques secondes à partir d’un fichier excel. Ils utilisent pour ça une liste de lieux connus (noms de pays, noms d’états américains). A voir si le vocabulaire français est disponible. </p>",
      "date": "2016-12-20",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Créer une carte en quelques secondes"
   },
   {
      "rawhtml": "<p>L’outil classique pour débugger un programme est d’utiliser le débugger qui fait partie de la librairie standard : <a href=\"https://docs.python.org/3.6/library/pdb.html\">pdb</a>. L’usage est simple, il suffit s’ajouter cette ligne dans son programme :</p> </p><p>Une autre possibilité est <a href=\"https://www.mihneadb.net/tracing-through-python-functions/\">ce petit package</a> qui fournit un décorateur à ajouter à la fonction que vous voulez analyser. Le décorateur enregistre le comportement de la fonction et on peut l’analyser par la suite via une interface graphique servie sur une interface web :</p>",
      "date": "2016-12-20",
      "images": [
         "location/in/app",
         "location/in/app"
      ],
      "tags": [],
      "title": "Débugger une fonction en Python"
   },
   {
      "rawhtml": "<p>J’ai récemment découvert la librairie javascript <a href=\"http://dygraphs.com/\">dygraphs</a> qui permet de créer des jolies séries temporelles avec lesquelles ont peut interagir dans le navigateur. </p><p>Il y a <a href=\"https://rstudio.github.io/dygraphs/\">une version R</a> qui permet de s’intégrer au markdown documents ou à Shiny ; <a href=\"http://blog.dygraphs.com/2014/09/pydygraphs-dygraphs-plotting-module-for.html\">une version Python</a> pour être mis dans les notebooks Jupyter. </p>",
      "date": "2016-12-20",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Séries Temporelles interactives"
   },
   {
      "rawhtml": "<p>Le package python <a href=\"http://hoverpy.readthedocs.io/en/latest/\">Hoverpy</a> a un rôle assez spécifique mais ça peut être utile :</p><ul><li>Phase 1 : Hoverpy est activé et enregistre les échanges http entre votre programme et l’extérieur (typiquement : une API externe que vous n’avez pas écrite)</li><li>Phase 2 : Hoverpy se substitue à l’API externe pour les requêtes qu’il a déjà observées. Votre programme, au lieu de requêter sur le web, requête en local les données enregistrées par Hoverpy. L’intérêt est par exemple de tester un script qui dépend d’une API externe. Ca peut aussi être utile si votre process repose sur une API publique qui a une limite dans le nombre de requêtes. </li></ul>",
      "date": "2016-12-20",
      "images": [],
      "tags": [],
      "title": "Rejouer des appels à une API"
   },
   {
      "rawhtml": "<p>Lorsqu’un algorithme de classification prend une décision qui impacte la vie d’humains, il faut prendre le temps de comprendre comment cette décision est prise. En particulier, est ce que mon algorithme est coupable de discriminer une population par rapport à une autre ? Il n’est pas toujours facile de répondre à cette question. </p><p><a href=\"https://research.google.com/bigpicture/attacking-discrimination-in-ml/\">Cet article</a> (vulgarisation de cet <a href=\"https://drive.google.com/file/d/0B-wQVEjH9yuhanpyQjUwQS1JOTQ/view\">article de recherche</a>) prend l’exemple d’un classifier qui décide si une personne peut ou non bénéficier d’un crédit et discute le cas où deux populations ont un taux de défaut différent. </p><p>Même sans connaître le fonctionnement interne de l’algorithme, il est possible d’imposer des contraintes qui garantissent que le système n’est pas discriminatoire. Plusieurs définitions peuvent être utilisées selon la situation.</p>",
      "date": "2017-01-04",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Classification sans discrimination ?"
   },
   {
      "rawhtml": "<p><a href=\"https://drill.apache.org/docs/why-drill/\">Drill est un outil Apache</a> qui promet de faciliter la manipulation de données multiples. Drill utilise une syntaxe SQL, permet de requêter de nombreux formats (Tables SQL ou Hive, fichiers JSON, bases no-sql…) et promet une mise en place rapide. Je suis preneur d’un retour d’expérience si quelqu’un a déjà utilisé cet outil. </p><p><a href=\"https://github.com/hrbrmstr/sergeant\">Ce package open source</a> permet de faire la connexion entre R et Drill. En particulier on peut utiliser la syntaxe dplyr pour requêter efficacement tous les formats que Drill supporte.</p>",
      "date": "2017-01-04",
      "images": [],
      "tags": [],
      "title": "Utiliser Drill depuis R (dplyr)"
   },
   {
      "rawhtml": "<p>S’il y a une chose que la communauté R fait bien, ce sont <a href=\"https://www.rstudio.com/resources/cheatsheets/\">les fiches de documentations</a> qui sont claires et concises. </p><p>Pandas s’inspire de ce modèle et <a href=\"https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf\">créé sa propre version</a></p>",
      "date": "2017-01-04",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Cheatsheet pour Pandas !"
   },
   {
      "rawhtml": "<p>Plusieurs solutions sont déjà connues pour mesurer le temps d’exécution des fonctions (la plus complète étant <a href=\"https://docs.python.org/3.5/library/profile.html\">cProfile</a>). Une petite librairie, <a href=\"https://github.com/ramonsaraiva/timy\">timy</a>, fournit une solution élégante et simple à utiliser en fournissant un décorateur et un context-manager. De plus on peut désactiver la mesure quand on a terminé la phase d’optimisation sans avoir à modifier le code. </p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Mesurer le temps d’exécution en Python"
   },
   {
      "rawhtml": "<p>La RATP a récemment mis à disposition en open data de <a href=\"https://data.ratp.fr/explore/?sort=modified\">nombreuses sources de données</a> :</p><ul><li>Horaires en temps réel</li><li>Positions géographiques des stations</li><li>Trafic annuel par station</li><li>…</li></ul><p>Par ailleurs Uber semble vouloir mettre à disposition prochainement un jeu de données contenant de l’ordre de <a href=\"https://movement.uber.com/cities\">2 milliards de trajets</a>. Par contre la licence est contraignante :</p><p>Movement makes all insights available under the Creative Commons, Attribution Non-Commercial license.</p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Données de transport"
   },
   {
      "rawhtml": "<p>Nous savons tous que choisir les bonnes couleurs pour un graphique peut prendre du temps. <a href=\"http://deanattali.com/blog/plot-colour-helper/\">Cet outil s’intègre à RStudio</a> et permet de changer dynamiquement les couleurs du graphique qu’on est en train de générer. </p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Plugin R Studio pour sélectionner les bonnes couleurs"
   },
   {
      "rawhtml": "<p>Il s’agit d’un <a href=\"https://blog.rstudio.org/2017/01/10/announcing-rstudio-connect-for-all-the-work-your-teams-do-in-r/\">nouveau produit RStudio</a>. Le logiciel tourne sur un serveur interne à l’entreprise et permet de rendre disponible des analyses R dans les formats classiques (Shiny, Markdown etc). Visiblement le logiciel peut interagir avec un système d’authentification existant et il fournit également un outil de monitoring du serveur. Bref un outil qui a l’ait puissant pour partager facilement nos analyses avec les clients. </p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Publier des analyses avec RStudio Connect"
   },
   {
      "rawhtml": "<p><a href=\"https://arxiv.org/pdf/0811.1679.pdf&amp;embedded=true\">Cet article</a> présente une technique pour retranscrire la manière dont un algorithme fait des prédictions en un ensemble de règles. C’est assez comparable dans l’idée aux méthodes ensemblistes reposants sur des arbres de décisions. Les résultats sont peut-être plus faciles à manipuler / interpréter. </p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Prédictions Ensemblistes par règles"
   },
   {
      "rawhtml": "<p>La librairie <a href=\"http://dask.readthedocs.io/en/latest/\">Dask</a> fournit des objets de type dataframe qui ont une syntaxe proche de Pandas mais qui permettent d’effectuer les calculs de manière distribuée sur un cluster. <a href=\"http://matthewrocklin.com/blog/work/2017/01/12/dask-dataframes\">Voir ici pour un exemple</a> d’utilisation. De manière générale, les différents composants de <a href=\"http://blaze.pydata.org/\">l’écosystème Blaze</a> sont à surveiller !</p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Utiliser Pandas dans une architecture distribuée"
   },
   {
      "rawhtml": "<p><a href=\"https://www.docker.com/what-docker\">Docker</a> est un outil pour mettre ensemble une application et l’ensemble de ses dépendances. L’idée est qu’il est ensuite facile de d’exécuter cet assemblage Docker sur une machine différente. <a href=\"https://github.com/bfirsh/whalebrew\">Whalebrew</a> est un outil qui facilite l’installation de composants à l’intérieur d’un assemblage Docker. La liste des <a href=\"https://github.com/whalebrew/whalebrew-packages\">applications officiellement supportées</a> est assez courte mais il est a priori possible d’installer d’autres applications facilement. </p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Faciliter l’installation d’applications dans Docker"
   },
   {
      "rawhtml": "<p>Nous avons vu il y a deux semaines <a href=\"http://matthewrocklin.com/blog/work/2017/01/12/dask-dataframes\">un premier tutoriel</a> sur l’utilisation de Dask : une librairie Python qui permet de traiter des données de manière distribuée aussi facilement que des dataframes Pandas.</p><p>Aujourd’hui <a href=\"http://matthewrocklin.com/blog/work/2017/01/24/dask-custom\">un deuxième article</a> qui insiste sur le rôle de Dask en prenant l’exemple d’un algorithme qui serait complexe à exprimer dans un paradigme map-reduce. Pour conclure, Dask c’est à la fois :</p><ul><li>Un outil de calcul distribué au même titre que Hadoop ou Spark</li><li>Un séquenceur d’exécution comme <a href=\"http://www.celeryproject.org/\">Celery</a>, <a href=\"https://github.com/spotify/luigi\">Luigi</a> ou <a href=\"https://airflow.incubator.apache.org/\">Airflow</a></li></ul><p>Figure : Dask génère des graphiques qui synthétise l'avancement de l'exécution sur les coeurs disponibles.</p>",
      "date": "2017-01-16",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Dask : à la fois un outil de calcul et un séquenceur d’exécution"
   },
   {
      "rawhtml": "<p>Si vous créer une application exposée à des utilisateurs ou contenant du texte saisi manuellement : vous aurez forcément des chaînes de caractères mal formatées que vous n’avez pas envisagées. <a href=\"https://github.com/minimaxir/big-list-of-naughty-strings\">Ce repository</a> contient simplement une liste de chaînes de caractères susceptibles de faire planter une application. Très utile pour mettre en place des tests unitaires !</p>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Chaînes de caractères malicieuses"
   },
   {
      "rawhtml": "<p>Lorsque j’utilise <a href=\"http://docs.ggplot2.org/current/\">ggplot2</a>, l’excellente librairie de visualisation en R, j’ai toujours besoin de regarder des exemples pour savoir comment obtenir ce que je veux. <a href=\"http://sharpsightlabs.com/blog/shipping-analysis-r-data-visualization/\">Ce court article</a> n’a rien d’exceptionnel en ce qui concerne l’analyse de données mais montre des exemples de visualisations bien travaillées.</p>",
      "date": "2017-01-16",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Un exemple d’utilisation poussée de ggplot"
   },
   {
      "rawhtml": "<p>Attention ce n’est peut être pas la source d’information la plus fiable : <a href=\"https://github.com/SocialDataSci/Geospatial_Data_with_Python\">un notebook</a> qui montre quelques exemples de librairies utiles pour la manipulation des données géographiques :</p><ul><li><a href=\"https://github.com/kjordahl/geopandas\">geopandas</a> - Working with spatial data is fun again!</li><li><a href=\"https://pypi.python.org/pypi/Shapely\">shapely</a> - For geometry handling</li><li><a href=\"http://toblerity.github.io/rtree/\">rtree</a> - For efficiently querying spatial data</li><li><a href=\"https://code.google.com/p/pyshp/\">pyshp</a> - For reading and writing shapefiles (in pure Python)</li><li><a href=\"https://code.google.com/p/pyproj/\">pyproj</a> - For conversions between projections</li><li><a href=\"http://toblerity.github.io/fiona/\">fiona</a> - For making it easy to read/write geospatial data formats</li><li><a href=\"https://pypi.python.org/pypi/GDAL/\">ogr/gdal</a> - For reading, writing, and transforming geospatial data formats</li><li><a href=\"https://code.google.com/p/geopy/\">geopy</a> - For geolocating and things like that</li><li><a href=\"http://pysal.org/\">pysal</a> - Spatial econometrics, exploratory spatial and spatio-temporal data analysis, spatial clustering (and more)</li><li><a href=\"https://pypi.python.org/pypi/descartes\">descartes</a> - For plotting geometries in matplotlib</li></ul>",
      "date": "2017-01-16",
      "images": [],
      "tags": [],
      "title": "Introduction à la manipulation des données géographiques en Python"
   },
   {
      "rawhtml": "<p>Facebook <a href=\"https://research.fb.com/prophet-forecasting-at-scale/?utm_campaign=Revue%20newsletter&amp;utm_medium=Newsletter&amp;utm_source=revue\">vient de rendre disponible</a> en open-source un module de prédiction de séries temporelles : <a href=\"https://github.com/facebookincubator/prophet\">Prophet</a>. Ce module semble reposer sur des techniques simples (ARIMA, lissage exponentiel, etc) mais a l’intérêt d’être facile à utiliser à la fois <a href=\"https://facebookincubator.github.io/prophet/docs/quick_start.html\">en R et en Python</a>.</p>",
      "date": "2017-02-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Prédictions de séries temporelles par Facebook"
   },
   {
      "rawhtml": "<p>Airbnb confirme sa position d’acteur majeur du monde de la datascience avec son outil de visualisation / exploration de données : <a href=\"https://github.com/airbnb/superset\">Superset</a> (anciennement Caravel). Cet outil permet de créer rapidement des dashboards à partir de données présentes en base. Il <a href=\"http://airbnb.io/superset/installation.html\">est possible d’installer</a> sa propre version en local et de servir les dashboards en tant qu’applications Web sur le réseau du client.</p>",
      "date": "2017-02-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Outil d’exploration de données par Airbnb"
   },
   {
      "rawhtml": "<p>Stéphane nous partage cet excellent <a href=\"https://neo4j.com/blog/buzzfeed-trumpworld-dataset-neo4j/\">tutoriel / exemple de l’utilisation de Neo4J</a> appliqué au jeu de données de relations entre personnes et organisations entourant Donal Trump. Ce tutoriel montre comment importer les données, définir les relations et fournit quelques exemples de requêtes qui peuvent être réalisées.</p>",
      "date": "2017-02-27",
      "images": [],
      "tags": [],
      "title": "Tutoriel Nea4J : Trumpworld Dataset"
   },
   {
      "rawhtml": "<p><a href=\"https://medium.com/zendesk-engineering/how-zendesk-serves-tensorflow-models-in-production-751ee22f0f4b\">Cet article de blog de Zendesk</a> décrit la manière dont ils mettent en production et font évoluer des modèles. En l’occurrence les modèles reposent sur TensorFlow et l’architecture est un ensemble d’instances AWS. </p>",
      "date": "2017-02-27",
      "images": [],
      "tags": [],
      "title": "Modèles de machine learning en production"
   },
   {
      "rawhtml": "<p>Le package <a href=\"http://www.data-imaginist.com/2017/Announcing-ggraph/\">gggraph</a> vient d’être publié : il s’agit d’une extension de ggplot2 spécifique à la représentation de données relationnelles. Il s’agit d’un package récent mais c’est à tester !",
      "date": "2017-02-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Visualisation de graphs / arbres en R"
   },
   {
      "rawhtml": "<p>Ce repository cherche à condenser une liste restreinte de 100 articles de recherche sur l’apprentissage profond. Il s’agit des articles publiés après 2012 qui ont eu le plus d’impact sur la communauté :</p><ul><li><a href=\"https://github.com/terryum/awesome-deep-learning-papers\">Awesome – Most Cited Deep Learning Papers</a></li></ul><p>Pour rappel, il existe d’autres repository qui agrègent les sources de cette manière – en général ils sont plus orientés tutoriels pratiques :</p><ul><li><a href=\"https://github.com/ujjwalkarn/Machine-Learning-Tutorials/\">Machine Learning Tutorials</a></li><li><a href=\"https://github.com/ujjwalkarn/DataScienceR\">DataScience with R</a></li><li><a href=\"https://github.com/ujjwalkarn/DataSciencePython\">DataScience with Python</a></li></ul>",
      "date": "2017-03-13",
      "images": [],
      "tags": [],
      "title": "Liste d’articles de recherche en Deep Learning"
   },
   {
      "rawhtml": "<p>Le PDF est un – en général – un format structuré relativement clair et des outils existent pour récupérer l’information qu’ils contiennent. Voir par exemple <a href=\"https://www.binpress.com/tutorial/manipulating-pdfs-with-python/167\">cette liste</a> pour une suggestion d’outil (<a href=\"http://euske.github.io/pdfminer/index.html\">PDFMiner</a> semble le plus utile). </p><p>Un problème plus compliqué est de récupérer les données d’un tableau lorsque le pdf a été généré à partir d’une image / scan d’un document texte. La librairie <a href=\"https://github.com/WZBSocialScienceCenter/pdftabextract\">pdftabextract</a> promet de rendre ce travail plus simple. En entrée on fournit des documents pdf en sortie d’un programme d’OCR (Optical Character Recognition ; ex : <a href=\"https://github.com/tesseract-ocr/tesseract\">tesseract</a>) et en sortie on obtient des dataframes Pandas. Voir <a href=\"https://datascience.blog.wzb.eu/2017/02/16/data-mining-ocr-pdfs-using-pdftabextract-to-liberate-tabular-data-from-scanned-documents/\">ici pour un tutoriel</a> détaillé d’utilisation. </p>",
      "date": "2017-03-13",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Extraire des données (tableau) depuis un PDF"
   },
   {
      "rawhtml": "<p>Vous connaissiez déjà <a href=\"http://www.data.gouv.fr/fr/\">http://www.data.gouv.fr/fr/</a> votre portail préféré de l’Open Source français. Si vous souhaitez changer d’échelle et passer au niveau Européen :</p><ul><li><a href=\"https://www.europeandataportal.eu/en\">https://www.europeandataportal.eu/en</a> regroupe les données des différents portails nationaux</li><li><a href=\"http://data.europa.eu/euodp/fr/data\">http://data.europa.eu/euodp/fr/data</a> met à disposition les données qui sont générées par les différentes institutions européennes</li></ul>",
      "date": "2017-03-13",
      "images": [],
      "tags": [],
      "title": "European Data Portal"
   },
   {
      "rawhtml": "<p>Les données géographiques ont toujours des spécifités de format qui les rendent plus difficiles à manipuler. <a href=\"http://www.computerworld.com/article/3175623/data-analytics/mapping-in-r-just-got-a-whole-lot-easier.html\">Ce tutoriel recommande</a> de s’appuyer sur deux packages :</p><ul><li><a href=\"https://github.com/edzer/sfr\">Simple Features for R</a> : permet de manipuler des data.frame dont les colonnes peuvent être des features au sens géographique : point, ligne, polygone, etc.</li><li> <a href=\"https://cran.r-project.org/web/packages/tmap/vignettes/tmap-nutshell.html\">tmap </a>: permet de générer des cartes à partir de features géographiques. Ce package utilise une synthaxe proche de ggplot. Il est possible de générer des images statiques ou des cartes interactives en s’appuyant sur <a href=\"https://rstudio.github.io/leaflet/\">leaflet</a>. </li></ul>",
      "date": "2017-03-13",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Manipuler et afficher des cartes en R"
   },
   {
      "rawhtml": "<p>Voir Youssef qui est maintenant l’expert sur le sujet. En ligne :</p><ul><li>le documentation officielle fournit une <a href=\"https://python-packaging.readthedocs.io/en/latest/index.html\">description exhaustive</a> de comment packager du code ainsi qu’une explication sur les notions de <a href=\"https://docs.python.org/3.5/tutorial/modules.html\">package et module</a></li><li><a href=\"https://medium.com/small-things-about-python/lets-talk-about-python-packaging-6d84b81f1bb5\">ce court article</a> décrit de manière <strong>synthétiques</strong> les étapes principales pour packager le code.</li></ul>",
      "date": "2017-03-13",
      "images": [],
      "tags": [],
      "title": "Création d’un package Python"
   },
   {
      "rawhtml": "<p>La mise en production d’un modèle entraîné reste une problématique récurrente chez nos clients. Une solution possible est de créer un service web : un serveur peut être requêté via une API REST. Une requête contenant les features est envoyée au server ; celui-ci retourne la prédiction. C’est ce que propose le framework <a href=\"https://github.com/manigoswami/lightningbolt\">Lightning-Bolt</a>  qui s’appuie sur Bottle pour la partie serveur et scikit-learn pour la prédiction. </p>",
      "date": "2017-03-27",
      "images": [],
      "tags": [],
      "title": "Servir un modèle de machine learning avec une API Web"
   },
   {
      "rawhtml": "<p>L’oubli est un problème qui se pose lors de l’apprentissage séquentiel de plusieurs tâches. Par exemple imaginons qu’un algorithme cherche à reconnaître les chiffres à partir d’images (MNIST). Si les données sont fournies à l’algorithme dans l’ordre des chiffres, il apprend les tâches séquentiellement : d’abord comment reconnaître le 0, puis le 1, le 2, etc. Puisque les paramètres de l’algorithme évoluent en continue (descente de gradient par exemple), il est possible qu’une fois arrivé au chiffre 9 l’algorithme ne sache plus reconnaître le 0 : il a « oublié ». Deux solutions sont possibles :</p><ul><li>Mélanger les données d’entraînement : c’est la solution triviale que nous utilisons systématiquement. Cependant cette solution n’est pas toujours réalisable ; elle nécessite en particulier que toutes les données existent au début de l’entrainement. C’est impossible dans une situation d’online learning ou compliqué dans le cas où les données ont été séparées en chunks homogènes. </li><li>Utiliser une méthode d’apprentissage qui empêche l’algorithme d’oublier. C’est cette méthode qui est expliquée dans <a href=\"http://www.pnas.org/content/early/2017/03/13/1611835114.full.pdf\">l’article de recherche suivant</a>. Ce blog fait l’effort de <a href=\"http://rylanschaeffer.github.io/content/research/overcoming_catastrophic_forgetting/main.html\">vulgariser</a> le contenu de l’article. L’idée principale est de réduire le pas d’apprentissage sur les paramètres du modèle qui ont été jugés comme cruciaux pour l’apprentissage d’une tâche précédente. </li></ul>",
      "date": "2017-03-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Apprentissage séquentiel : comment ne pas oublier"
   },
   {
      "rawhtml": "<p>Vous rêvez d’être à la tête du prochain BigBrother ? Ou bien voulez vendre une application qui recommande le chapeau le plus adapté au visage du client ? Dans tous les cas vous aurez besoin d’une méthode qui extrait / reconnaît les visages présents dans une photo. Le package python <a href=\"https://github.com/ageitgey/face_recognition\">face_recognition</a> permet de faire ce type d’opérations avec une API simple. Le package vient avec un algorithme <a href=\"http://vis-www.cs.umass.edu/lfw/\">pré-entraîné sur un jeu de plus de 5000</a> personnes. </p>",
      "date": "2017-03-27",
      "images": [
         "location/in/app",
         "location/in/app"
      ],
      "tags": [],
      "title": "Reconnaissance de visages"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/AdeelK93/collapsibleTree\">Ce package R</a> permet d’afficher des arbres interactifs (<a href=\"https://adeelk93.shinyapps.io/collapsibletree/\">démo</a>) : on peut cliquer sur les nœuds de l’arbre pour les fermer / ouvrir. Ce package s’appuie sur le <a href=\"https://bl.ocks.org/mbostock/4339083\">collapsibleTree</a> de D3.js. </p>",
      "date": "2017-03-27",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Afficher des arbres interactifs en R"
   },
   {
      "rawhtml": "<p>L’objectif de ce projet est de classifier des images de cellules (globules blanc) en différentes catégories qui correspondent à des pathologies. Dans <a href=\"https://blog.athelas.com/classifying-white-blood-cells-with-convolutional-neural-networks-2ca6da239331\">cet article de blog</a>, l’auteur explique comment un réseau de neurones a été entrainé pour faire cette classification. <a href=\"https://github.com/dhruvp/wbc-classification/blob/master/notebooks/binary_training.ipynb\">Le code</a> est également disponible. L’auteur travaille visiblement chez <a href=\"https://athelas.com/\">Athelas</a> qui cherche à commercialiser une solution de diagnostic rapide à partir de ce qui est présenté dans l’article. </p>",
      "date": "2017-04-10",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Deep Learning pour l’analyse d’images médicales"
   },
   {
      "rawhtml": "<p><a href=\"https://explainshell.com/explain?cmd=netstat+-tulpn+%7C+grep+python\">Ce petit site</a> permet de saisir une ligne de commande bash un peu complexe et fournit une explication synthétique de tous les composants de cette ligne de commande. Très pratique pour être sûr de ne pas faire de bêtises. </p>",
      "date": "2017-04-10",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Expliquer les lignes de commandes bash"
   },
   {
      "rawhtml": "<p>La team Azure met à disposition des petits outils d’exploration interactive de données qui se présentent sous la forme :</p><ul><li>D’un <a href=\"https://github.com/Azure/Azure-TDSP-Utilities/blob/master/DataScienceUtilities/DataReport-Utils/Python/IDEAR-Python-Instructions-JupyterNotebook.md\">notebook python</a></li><li>D’une <a href=\"https://github.com/Azure/Azure-TDSP-Utilities/blob/master/DataScienceUtilities/DataReport-Utils/R/team-data-science-process-idear-instructions.md\">application shiny pour R</a></li></ul><p>Par ailleurs il semblerait qu’une <a href=\"https://blogs.technet.microsoft.com/machinelearning/2017/04/05/latest-rev-of-utilities-for-microsoft-team-data-science-process-tdsp-now-available/\">version existe également pour MRS</a> (Microsoft R Server) et que cette version est capable de travailler sur des gros datasets (les versions présentée plus haut chargent en mémoire les dataset pour faire les visualisations). </p>",
      "date": "2017-04-10",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Exploration de données par Microsoft"
   },
   {
      "rawhtml": "<p>Certains se rappelleront avec amertume de l’appel d’offre SNCF de géolocalisation Wifi.. Pour ceux qui ne savent pas de quoi je parle, je vous conseille de parcourir <a href=\"http://www.gizmodo.co.uk/2017/04/exclusive-heres-what-museums-learn-by-tracking-your-phone/\">cet article vulgarisé</a> qui explique rapidement comment les signaux wifi de nos téléphones peuvent être utilisés pour réaliser des cartes de flux à l’intérieur des bâtiments. L’exemple présenté ici concerne la National Gallery à Londres et a été mené par la société <a href=\"http://www.polkaspots.com/about/\">Polkaspots</a>.</p>",
      "date": "2017-04-10",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Mesure de flux de personnes à partir de signaux WiFi"
   },
   {
      "rawhtml": "<p>Le package <a href=\"https://github.com/Anaconda-Platform/nbpresent\">nbpresent</a> permet de créer des slides à partir des outputs d’un Jupyter Notebook. De plus ces outputs peuvent rester interactifs (le package <a href=\"https://github.com/jupyter-widgets/ipywidgets\">ipywidgets</a> permet de définir facilement des menus déroulant, des sliders, etc.)</p>",
      "date": "2017-04-10",
      "images": [],
      "tags": [],
      "title": "A TESTER : Transformez vos Notebooks en Web App en quelques clicks"
   },
   {
      "rawhtml": "<p>Google <a href=\"https://opensource.googleblog.com/2017/04/tf-seq2seq-sequence-to-sequence-framework-in-tensorflow.html\">publie un nouveau framework</a> qui s’appuie sur TensorFlow : tf-seq2seq (sequence to sequence). Les cas d’utilisation standard de ce framework sont la traduction, la synthèse de documents textuels, les chatbots. La <a href=\"https://google.github.io/seq2seq/getting_started/\">documentation</a> contient plusieurs exemples. </p>",
      "date": "2017-04-10",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Encore des innovations sur le NLP par Google"
   },
   {
      "rawhtml": "<p>Des chercheurs de Icahn School of Medicine at Mount Sinai Medical School (New York) ont exploité les données médicales de 700 000 patients. <a href=\"https://www.nature.com/articles/srep26094\">Le résultat principal</a>  (<a href=\"http://www.readcube.com/articles/10.1038/srep26094\">pdf</a>) qu’ils présentent est la structuration de ces données : comment construire des features intéressantes à partir de sources variées (comptes-rendus, diagnostics, traitements, etc.). Ils ont utilisé un ensemble d’auto-encodeurs pour construire les features permettant de décrire précisément chaque personne. La pertinence de leur description est validée par son utilisation par un algorithme prédictif. Leur méthode de construction de feature permet une prédiction de meilleure qualité. </p>",
      "date": "2017-04-24",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Comment représenter l’historique des patients ?"
   },
   {
      "rawhtml": "<p>Vous savez bien sûr déjà comment mesurer le temps d’exécution d’un programme ou des différentes fonctions au sein d’un programme (<a href=\"https://docs.python.org/3.5/library/profile.html\">cProfile</a>). Aujourd’hui vous pouvez également <a href=\"https://pypi.python.org/pypi/memory_profiler\">mesurer</a> comment l’impact du programme en terme de mémoire RAM. Très utile si on utilise massivement les dataFrame Pandas qui peuvent être gourmands en mémoire.   </p>",
      "date": "2017-04-24",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Surveiller la gestion de la mémoire en Python"
   },
   {
      "rawhtml": "<p>Microsoft a <a href=\"https://blogs.technet.microsoft.com/dataplatforminsider/2017/04/19/python-in-sql-server-2017-enhanced-in-database-machine-learning/\">annoncé récemment</a> que la prochaine version de SQL Server permettrait d’exécuter du code Python directement dans la base de données. Pour comprendre comment cela fonctionne, on peut regarder la documentation pour <a href=\"https://docs.microsoft.com/en-us/sql/advanced-analytics/r/sql-server-r-services\">SQL Server R Services</a> puisque le langage R est adopté depuis l’année dernière. </p>",
      "date": "2017-04-24",
      "images": [],
      "tags": [],
      "title": "Python/R dans SQL Server"
   },
   {
      "rawhtml": "<p>Des chercheurs de Berkeley présentent dans <a href=\"https://arxiv.org/pdf/1611.07004.pdf\">cet article</a> une méthode de traduction qui prend en entrée une image et fournit en sortie une nouvelle image. La méthode repose sur un Generative Adversarial Network (GAN). <a href=\"https://phillipi.github.io/pix2pix/\">L’implémentation</a> utilise Torch, une autre personne a <a href=\"https://affinelayer.com/pix2pix/\">refait le projet</a> en s’appuyant sur Tensorflow. Enfin un outil en ligne qui utilise cette techno vous permet de <a href=\"https://affinelayer.com/pixsrv/index.html\">dessiner des chatons</a> !</p><p> ",
      "date": "2017-04-24",
      "images": [
         "location/in/app"
      ],
      "tags": [],
      "title": "Image -&gt; Image"
   },
   {
      "rawhtml": "<p><a href=\"https://github.com/pachyderm/pachyderm\">Pachyderm est un outil</a> qui permet de gérer de manière abstraite des données et la manière dont elles sont transformées par un pipeline de traitement. Par <a href=\"https://github.com/pachyderm/pachyderm/tree/master/doc/examples/ml/tensorflow\">exemple</a> il peut être utilisé pour gérer les différents datasets de l’exemple précédent de transformation d’images. L’intérêt d’utiliser un outil comme Pachyderm (ou <a href=\"https://github.com/spotify/luigi\">Luigi</a> / <a href=\"https://airflow.incubator.apache.org/\">Airflow</a>) est la reproductibilité du traitement et sa modularité. </p>",
      "date": "2017-04-24",
      "images": [],
      "tags": [],
      "title": "Versionning de données et construction de pipelines"
   }
]